{
    "BACS 100": {
        "shortName": "BACS 100",
        "fullName": "Life Span Human Development",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces students to the physical, cognitive and psychological aspects of human development from birth through advanced old age. Topics include: environmental influences, perception, gender roles and sexuality, spirituality, motivation, life styles, and psychiatric disorders.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "BACS 101": {
        "shortName": "BACS 101",
        "fullName": "Human Sexuality",
        "courseCredits": "3.0",
        "courseDesc": "This course utilizes global perspectives (biological, historical, developmental, psychological, sociological and self-reflexive approaches) to explore the diversity of human sexuality.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "BACS 200": {
        "shortName": "BACS 200",
        "fullName": "Foundation of Behavioral Health Care",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces the students to the historical and current contexts of program components that comprise community-based behavioral health systems. Topics include: work-force roles; regulatory policies and program practices; federal, state, and county program organizations; advocacy issues; and managed care systems issues.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 101 [Min Grade D], ENGL 111 [Min Grade D], ENGL 102 [Min Grade D], ENGL 112 [Min Grade D], ENGL 103 [Min Grade D], ENGL 113 [Min Grade D] (Can be taken Concurrently)",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "BACS 211": {
        "shortName": "BACS 211",
        "fullName": "Introduction to Poetry Therapy",
        "courseCredits": "3.0",
        "courseDesc": "This course facilitates an exploration of Biblio-Poetry Therapy process as a way to develop an understanding of self, honing the skills for listening and compassion as we connect with each other through universal experiences. Students will engage in a rich learning experience which is trauma informed and will be able to identify how writing impacts the brain of a trauma survivor.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "BACS 212": {
        "shortName": "BACS 212",
        "fullName": "Therapeutic Gaming",
        "courseCredits": "3.0",
        "courseDesc": "This course explores the theory and application of games as related to the fields of therapy, mental health, and development. The purpose of the course is to develop critical understanding of the benefits of gaming as it applies to holistic wellbeing. Students will first examine what the form and function of games are. Students will develop an understanding of what is defined as therapeutic. Specific dimensions of therapy, including cognitive, social, and emotional changes, will be explored. Students will also engage in critical examination of systemic and ethical issues related to the use of games in therapy, such as the presence of racism, sexism, ableism, heterosexism, and other “-ism’s” in-game, in player communities, and in creator communities.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 213": {
        "shortName": "BACS 213",
        "fullName": "Visual Arts and Community Engagement",
        "courseCredits": "3.0",
        "courseDesc": "Students take on the role of art mentor under the guidance of a credentialed, licensed, art therapist in a community setting. Applied practice will integrate knowledge of art, psychology, education, community engagement, and art therapy for applied practice. Students will develop and facilitate responsive art engagements with a local community group. This course culminates with a student-generated portfolio that demonstrates an understanding of the value of civic responsibility through creative activities across the lifespan.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "BACS 214": {
        "shortName": "BACS 214",
        "fullName": "Interpersonal Skills and Group Dynamics",
        "courseCredits": "3.0",
        "courseDesc": "This course will assist students in expanding their understanding of interpersonal and communication skills for application in a range of professional contexts. Students will develop an understanding of communication theories, values and ethics and the importance of cultural sensitivity.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 215": {
        "shortName": "BACS 215",
        "fullName": "Ecological Frameworks of Wellness",
        "courseCredits": "3.0",
        "courseDesc": "This course will assist students in expanding their understanding of ecological frameworks for wellness and how environments interact to influence the individual, the family, the community, and society.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 220": {
        "shortName": "BACS 220",
        "fullName": "Counseling Theory and Practice",
        "courseCredits": "3.0",
        "courseDesc": "Surveys major counseling theories with emphasis upon study and practice of basic counseling competencies. Topics include: relationship building, effective communication and helping skills, common stages in counseling process, and helping skills with special populations.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 232": {
        "shortName": "BACS 232",
        "fullName": "Ethics and Professional Responsibility",
        "courseCredits": "3.0",
        "courseDesc": "This course discusses the philosophical, legal and moral responsibilities of professionals in behavioral health and human services setting with a strong emphasis on counseling relationships. A wide array of ethical issues are presented and discussed. Moral dilemmas comprised of competing moral obligations are examined.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "BACS 234": {
        "shortName": "BACS 234",
        "fullName": "Introduction to Addictive Disorders",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces the nature of addictions and the impairment in individuals who suffer from addictions. It includes a review of theories on substance disorders and approaches to identification, prevention and treatment. Topics include: historical perspectives, diagnosis, types of addictive behaviors, treatment, and current research.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 236": {
        "shortName": "BACS 236",
        "fullName": "Psychiatric Rehabilitation Principles and Practices",
        "courseCredits": "3.0",
        "courseDesc": "This is an introductory course which orients the student to the principles and practices of Psychiatric Rehabilitation. It provides the student with an understanding of the manner in which Psychiatric Rehabilitation approaches, understands and assists people with serious mental illnesses. The course also surveys the service settings where this practice is applied.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 101 [Min Grade D], ENGL 111 [Min Grade D], ENGL 102 [Min Grade D], ENGL 112 [Min Grade D], ENGL 103 [Min Grade D], ENGL 113 [Min Grade D] (Can be taken Concurrently)",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "BACS 255": {
        "shortName": "BACS 255",
        "fullName": "Multicultural Counseling",
        "courseCredits": "3.0",
        "courseDesc": "This course provides information and practice opportunities for developing cultural competence and socially just practices in behavioral health. Students will develop awareness and skills necessary for establishing therapeutic relationships with clients of diverse cultural backgrounds.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BACS 220 [Min Grade D] (Can be taken Concurrently)",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "BACS 300": {
        "shortName": "BACS 300",
        "fullName": "Poetry and Biblio Peer Group Facilitation",
        "courseCredits": "3.0",
        "courseDesc": "This course facilitates an in-depth and experiential understanding of Biblio-Poetry Therapy process as a way to develop an understanding of self, honing the skills for listening and compassion as we connect with each other through universal experiences. Students will engage in a rich learning experience which is trauma informed and will be able to identify how Poetry can be used as a therapeutic modality to help clients manage difficult emotions. Students will also undergo rigorous supervised field work to develop competence in conducting PT groups and sessions.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BACS 211 [Min Grade C]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 301": {
        "shortName": "BACS 301",
        "fullName": "Group Counseling I",
        "courseCredits": "3.0",
        "courseDesc": "This course is an introduction to the theoretical base and skills used in conducting group counseling. Included are theories of group work, facilitation techniques, types and styles of groups and models of group functioning. Students participate in a group as a group member and to act as a group co-leader in order to practice leadership skills.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BACS 220 [Min Grade D] (Can be taken Concurrently)",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "BACS 310": {
        "shortName": "BACS 310",
        "fullName": "Recovery and Relapse Prevention",
        "courseCredits": "3.0",
        "courseDesc": "The goal of recovery and relapse preventions is the development personal strategies that will help the person restructure their life in a way that will prevent a return to active addiction. This course helps define the role of professional counselor in understanding the dynamic of recovery from a clinical perspective.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 312": {
        "shortName": "BACS 312",
        "fullName": "Case Management Methods",
        "courseCredits": "3.0",
        "courseDesc": "This course is an in-depth explorations of the definitions and methodologies of case management services. The course is designed to provide students with the most up to date research and clinical applications of services management in the practice of addictions counseling.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "BACS 313": {
        "shortName": "BACS 313",
        "fullName": "Foundations of Art Therapy: Theory and Practice",
        "courseCredits": "3.0",
        "courseDesc": "This course facilitates an exploration of the creative process as a way to understand more about self and other. Calling upon the history of materials and strategies informed by psychological, philosophical and applied approaches of therapeutic art and art therapy practices, students will engage in a rich, media- based approach to learning.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "BACS 314": {
        "shortName": "BACS 314",
        "fullName": "Introduction to Music Therapy",
        "courseCredits": "3.0",
        "courseDesc": "Music Therapy is a healthcare profession wherein musical experiences are used within a therapeutic relationship to address biopsychosocial goals. During this course, students will be introduced to the primary music therapy methods, goals and outcomes of treatment, and clinical case descriptions through audio and video material.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 315": {
        "shortName": "BACS 315",
        "fullName": "Introduction to Family Therapy",
        "courseCredits": "3.0",
        "courseDesc": "This course is an introduction to classic and contemporary family therapy theory, concepts, models, and methods. Its purpose in the program plan of study is to provide broad knowledge and historical understanding of family therapy approaches.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "BACS 320": {
        "shortName": "BACS 320",
        "fullName": "Crisis and Brief Intervention",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces student to the fundamental concepts, theories, strategies, and skills needed to understand and conduct effective crisis and brief intervention counseling. Particular attention is given to several types of crises commonly encountered in working within settings serving people who have long-term disabling psychiatric disorders.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 345": {
        "shortName": "BACS 345",
        "fullName": "Careers in Behavioral Health",
        "courseCredits": "3.0",
        "courseDesc": "There are numerous career choices available within the field of Behavioral Health. In order to help you prepare for the future, this course explores the roles, responsibilities, and healthcare settings associated with careers such as counselor, psychiatric rehabilitation practitioner, social worker, therapist, psychologist, psychiatrist, advocate, and others. We explore opportunities to work with children, adults, and seniors in hospital and community treatments settings as well as in schools and in the community at large. We also examine the educational requirements of different fields of professional practice and review graduate schools options. Students explore their strengths and preferences related to future employment and begin to formulate personal plans for academic and professional success.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "BACS 360": {
        "shortName": "BACS 360",
        "fullName": "Preventing Substance Abuse",
        "courseCredits": "3.0",
        "courseDesc": "This course provides a comprehensive overview of prevention theories and prevention programming applications as regards substance use disorders. Course topics include: theories and models basic to prevention, science-based prevention strategies and model programs, strategic planning and outcome evaluation.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 368": {
        "shortName": "BACS 368",
        "fullName": "Addictions Counseling with Special Populations",
        "courseCredits": "3.0",
        "courseDesc": "This course involves the student in examinations of challenges for addictions counselors in working with frequently underserved populations represented by adolescents and elderly persons. Effective approaches to assessing and treating both youthful and older adult individuals with addiction disorders are explored and defined.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 380": {
        "shortName": "BACS 380",
        "fullName": "Trauma-Informed Care",
        "courseCredits": "3.0",
        "courseDesc": "This is an introduction to the psychophysiology of complex trauma in children and adolescents, and an overview of assessment and treatment modalities in both youth and adults. The course focuses on neurobiology and how trauma impairs brain development and the life domains of children, adolescents, and adults. It also covers various issues of assessment, diagnosis, and treatment. The stages of stabilization, reprocessing and reintegration, and the multiple models helpers utilize when working with survivors of trauma are explored. Course work will culminate with students reviewing and presenting case studies of assessment and treatment interventions for children and adolescents experiencing traumatic effects.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Summer"
    },
    "BACS 400": {
        "shortName": "BACS 400",
        "fullName": "Poetry and Biblio Facilitation Fieldwork and Supervision",
        "courseCredits": "3.0",
        "courseDesc": "This course provides students with field experience and supervision with at least two populations. The course will enable students to accrue hours towards becoming a poetry and biblio facilitator in the community.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BACS 211 [Min Grade C] and BACS 300 [Min Grade C]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 401": {
        "shortName": "BACS 401",
        "fullName": "Assessment and Treatment Planning",
        "courseCredits": "3.0",
        "courseDesc": "The focus of this course is learning the systematic, multi-disciplinary approach for gathering, interpreting, applying and recording data regarding clients in addictions and other behavioral health treatment settings. The most current screening, assessment, treatment planning and documentation approaches are covered.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BACS 220 [Min Grade D] (Can be taken Concurrently)",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 403": {
        "shortName": "BACS 403",
        "fullName": "Poetry and Biblio Facilitation Fieldwork and Supervision II",
        "courseCredits": "3.0",
        "courseDesc": "This course provides students with field experience and supervision with at least two populations. The course will enable students to accrue hours towards becoming a poetry and biblio facilitator in the community.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BACS 400 [Min Grade C]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 406": {
        "shortName": "BACS 406",
        "fullName": "Poetry and Biblio Facilitation Fieldwork and Supervision III",
        "courseCredits": "3.0",
        "courseDesc": "This course provides students with field experience and supervision with at least two populations. The course will enable students to accrue hours towards becoming a poetry and biblio facilitator in the community.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BACS 400 [Min Grade C] and BACS 403 [Min Grade C]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 414": {
        "shortName": "BACS 414",
        "fullName": "Co-Occurring Disorders",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces an integrated treatment approach for working with individuals who have both mental illness and substance use disorders. Topics include: assessment and treatment planning, strategies for coordinating dual interventions.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 420": {
        "shortName": "BACS 420",
        "fullName": "Psychiatric Rehabilitation Competencies",
        "courseCredits": "3.0",
        "courseDesc": "The purpose of this advanced course is to help students develop the competencies necessary to implement the principles and practices of Psychiatric Rehabilitation. This is accomplished by engaging the student in an in-depth analysis of the tools and processes used to bring about outcomes related to community integration and the life quality.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS 430": {
        "shortName": "BACS 430",
        "fullName": "Behavioral Health and Aging",
        "courseCredits": "3.0",
        "courseDesc": "Students will explore concepts, issues, and research pertaining to the psycho-social and behavioral health aspects of working with older adults. Students will learn about and practice interventions, competencies, and strategies designed to improve the quality of life of older adults.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS I299": {
        "shortName": "BACS I299",
        "fullName": "Independent Study in Behavioral & Addictions Counseling",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed course within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS I399": {
        "shortName": "BACS I399",
        "fullName": "Independent Study in Behavioral & Addictions Counseling",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed course within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS I499": {
        "shortName": "BACS I499",
        "fullName": "Independent Study in Behavioral & Addictions Counseling",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed course within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS T280": {
        "shortName": "BACS T280",
        "fullName": "Special Topics in Behavioral & Addictions Counseling",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS T380": {
        "shortName": "BACS T380",
        "fullName": "Special Topics in Behavioral & Addictions Counseling",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "BACS T480": {
        "shortName": "BACS T480",
        "fullName": "Special Topics in Behavioral & Addictions Counseling",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    }
}