{
    "DSMR 100": {
        "shortName": "DSMR 100",
        "fullName": "Computer Imaging I",
        "courseCredits": "3.0",
        "courseDesc": "The course explores the fundamentals of computer design software including Adobe Photoshop, Illustrator and InDesign. Projects include graphics creation and manipulation; image acquisition, text creation and manipulation; typography; input and output options and control; hardware/software/system fundamentals; and troubleshooting as they relate to the creative industries.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "DSMR 103": {
        "shortName": "DSMR 103",
        "fullName": "Introduction to the Fashion Industry",
        "courseCredits": "3.0",
        "courseDesc": "Introduces the materials and methods used to design, develop, and market the fashion product, including current vocabulary and foundation of knowledge about industry practices and career opportunities.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "DSMR 201": {
        "shortName": "DSMR 201",
        "fullName": "Analysis of Product",
        "courseCredits": "3.0",
        "courseDesc": "This course examines the product development process from concept to consumer. Students will analyze the global supply chain and learn about sustainable product strategies.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "DSMR 210": {
        "shortName": "DSMR 210",
        "fullName": "Presentation Techniques Design and Merchandising",
        "courseCredits": "3.0",
        "courseDesc": "In Presentation Techniques students learn the various types of presentations used within a professional workplace environment. Students learn methods and practice public speaking, storytelling, rhetoric, and digital design skills to create slide decks, white papers, and short videos related to a relevant prompt specific to the fashion lifestyle industry.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(VSST 102 [Min Grade D] or VSST 105 [Min Grade D]) and (VSCM 100 [Min Grade D] or DSMR 100 [Min Grade D] or WEST 100 [Min Grade D]) and DSMR 211 [Min Grade D] and COM 230 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Spring "
    },
    "DSMR 211": {
        "shortName": "DSMR 211",
        "fullName": "Digital Design for Design and Merchandising",
        "courseCredits": "3.0",
        "courseDesc": "This course builds skills and processes in using digital design tools and industry research and their application in the development of a range of merchandising presentations. Students learn to use an array of Adobe Creative Suite tools, trend intelligence and retail analytics to present curated, balanced, and strategic product offerings.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "VSCM 100 [Min Grade D] or DSMR 100 [Min Grade D] or WEST 100 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter "
    },
    "DSMR 215": {
        "shortName": "DSMR 215",
        "fullName": "Digital Commerce & Promotion",
        "courseCredits": "3.0",
        "courseDesc": "The Internet has changed nearly every aspect of how lifestyle brands operate in the 21st century. Digital marketing, social media, and e-commerce have become crucial to merchandising fashion apparel, accessories, home fashion and beauty business growth. In this course students will gain a deeper understanding of how the digital economy works, and they will develop the critical insights necessary to design a brand strategy to succeed in e-commerce, digital, and social media marketing.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Spring "
    },
    "DSMR 230": {
        "shortName": "DSMR 230",
        "fullName": "Textiles for Design and Merchandising",
        "courseCredits": "3.0",
        "courseDesc": "Examines the textile manufacturing industry and the fundamental processes involved in producing natural and man-made fabrics as they relate to Design & Merchandising. Includes basic terminology and production processes as well as selection and evaluation of fabrics based on aesthetics, performance and care characteristics.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "DSMR 231": {
        "shortName": "DSMR 231",
        "fullName": "Retail Operations",
        "courseCredits": "3.0",
        "courseDesc": "Examines retail philosophies within an operational context, including understanding how consumption, present and future, determines a retailer's strategy.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter "
    },
    "DSMR 232": {
        "shortName": "DSMR 232",
        "fullName": "Merchandise Planning and Buying",
        "courseCredits": "4.0",
        "courseDesc": "Provides a working knowledge of merchandise planning, flow, and distribution in the retail setting. Covers profitable merchandise and assortment planning and control in both conceptual and technical formats. Final project incorporates six-month financial, classification, and assortment planning.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "DSMR 231 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Spring "
    },
    "DSMR 233": {
        "shortName": "DSMR 233",
        "fullName": "Branding and Retail Strategies",
        "courseCredits": "3.0",
        "courseDesc": "Students will perform an in-depth analysis of theoretical and applied retail product and brand research. Qualitative, quantitative and triangulation methods of research will be discussed. The course focuses on researching, writing and presenting various topics in a professional environment.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Summer"
    },
    "DSMR 300": {
        "shortName": "DSMR 300",
        "fullName": "Design and Merchandising Trends and Impact",
        "courseCredits": "3.0",
        "courseDesc": "An exploration of a specialized area of the industry which is relevant to the zeitgeist.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 12 times for 39 credits",
        "prereqs": "DSMR 231 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Spring "
    },
    "DSMR 310": {
        "shortName": "DSMR 310",
        "fullName": "Merchandising Operations & Management",
        "courseCredits": "3.0",
        "courseDesc": "This course will focus on the apparel & non-apparel management functions that exist between the merchandising, design, production and promotion elements of the product supply chain. Students will utilize retail analytics, trend intelligence, excel applications and assortment and allocation planning to execute merchandising strategies, sales plans and margin goals.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "DSMR 232 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring "
    },
    "DSMR 311": {
        "shortName": "DSMR 311",
        "fullName": "Visual Merchandising",
        "courseCredits": "3.0",
        "courseDesc": "Visual Merchandising combines design skills, consumer psychology and marketing principles to create window displays, floor merchandising and plan-o-grams in a retail environment that entices consumers to buy. Students will investigate related areas of store planning and design, point-of-purchase display, fixture design, and topics on trend in the industry. Students will apply the principles and elements of design in merchandise presentation, analysis and experimentation and field research. Methods of promoting and selling merchandise, analyzing leading retail firms, employing basic methods of displaying merchandise, and developing a basic understanding of the use of special materials and lighting will be integrated into experiential projects outside of the classroom.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "DSMR 232 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring Summer"
    },
    "DSMR 315": {
        "shortName": "DSMR 315",
        "fullName": "Media Merchandising I",
        "courseCredits": "3.0",
        "courseDesc": "In Media Merchandising I students learn the process of creating, designing, and publishing a digital publication. The students develop all content organized around themes of school, city, fashion, product, and technology, and the various intersections as it relates to design and merchandising.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": "VSST 103 [Min Grade D] and DSMR 210 [Min Grade D] and DSMR 211 [Min Grade D] and ENGL 103 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "DSMR 316": {
        "shortName": "DSMR 316",
        "fullName": "Media Merchandising II",
        "courseCredits": "3.0",
        "courseDesc": "Media Merchandising II is a continuation of Media Merchandising I, where students learn to engage in strategic decision making related to digital content such as, informational articles, interviews, photography, graphic design, social media, interactive media and paid advertisement. The results of the student’s learning process is a premier fashion lifestyle digital publication.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": "DSMR 315 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "DSMR 319": {
        "shortName": "DSMR 319",
        "fullName": "Beauty Merchandising & Marketing",
        "courseCredits": "3.0",
        "courseDesc": "Learn how beauty products are developed, merchandised, packaged and marketed. This course will cover the history of the industry, iconic brands, and walk through the process of product ideation, development/testing, merchandising and distribution. Students will understand the importance of packaging and presentation.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 4 times for 15 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR 321": {
        "shortName": "DSMR 321",
        "fullName": "Fashion Show Production I",
        "courseCredits": "3.0",
        "courseDesc": "This course is an examination of the Fashion Show as a sales and marketing tool and as a historically important event in the evolution of the fashion industry. An understanding of all behind-the-scenes aspects of a professional fashion show will be discussed. This course introduces a hands-on experience in addition to academic course work. Especially for students interested in event planning, public relations and marketing, this course provides experience that will be valuable as students enter the workplace.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "DSMR 324": {
        "shortName": "DSMR 324",
        "fullName": "Retail Intersections: Social & Cultural Issues",
        "courseCredits": "3.0",
        "courseDesc": "Those who participate in the business of fashion such as retailers, merchants, designers, manufacturers and stylists must evolve in order to sell to customers. Throughout their lives, students are exposed to retailing, merchandising, buying, design, sales, branding, promotions, manufacturing and other such fields. For those interested in the study of retailing, fashion and merchandising, it is essential to understand landmark research and theoretical concepts behind the influences of this field and how social change, innovations and with the evolution of a multicultural marketplace, shifts have occurred over generations, and into the 21st century. This conceptual and theoretical course will expose students to a diverse range of clients and consumers.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "DSMR 231 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "DSMR 330": {
        "shortName": "DSMR 330",
        "fullName": "Immersive Media and Merchandising",
        "courseCredits": "3.0",
        "courseDesc": "This multi-discipline course is bringing together brand strategy & merchandising (D&M) with the immersive media experience of the Digital Media program. Students will explore digital solutions for the business of fashion and develop solutions using immersive media in virtual & real space. Groups will combine students from Design and Merchandising & Digital Media to explore opportunities to plan and implement immersive solutions specific to the textile, fashion, and lifestyle industries.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 12 times for 39 credits",
        "prereqs": "DSMR 310 [Min Grade C] or ENTP 440 [Min Grade C]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "DSMR 332": {
        "shortName": "DSMR 332",
        "fullName": "Product Styling for Digital Commerce",
        "courseCredits": "3.0",
        "courseDesc": "Styling is the practice of visual communication from briefs for a particular aesthetic for large-scale photo shoots, product photography or flat-lays. These skills are applicable skills for product styling, and photography styling for ecommerce, covering the latest in design trends; practical case studies and expert styling tips, tricks and advice. Student teams will combine their knowledge of photography and merchandising to understand and execute photo shoots for a broad range of ecommerce categories including apparel, beauty, footwear, jewelry, home décor, food, and electronics. The course with culminate with a photoshoot; conceptualized and created from start to finish.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 4 times for 15 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR 333": {
        "shortName": "DSMR 333",
        "fullName": "Fashion Product Development and Sourcing",
        "courseCredits": "3.0",
        "courseDesc": "Provides an overview of the development of knitted and woven, apparel and non-apparel products. The execution of line development will include market research, sourcing, costing, markup planning and category analysis. Students will evaluate global supply chains and circularity using product lifecycle management technology.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "DSMR 231 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring Summer"
    },
    "DSMR 410": {
        "shortName": "DSMR 410",
        "fullName": "Career Strategies for Design and Merchandising",
        "courseCredits": "3.0",
        "courseDesc": "Course develops skills that enable the student to put into place an effective job search strategy. Specifically geared to the D&M professions, students develop comprehensive area of expertise including networking, industry research, and industry hiring trends.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR 464": {
        "shortName": "DSMR 464",
        "fullName": "Merchandising Analytics",
        "courseCredits": "3.0",
        "courseDesc": "An integral part of today’s retail environment is data analytics. This real-world data-driven course highlights a variety of critical retail metrics and analyses that will demonstrate and support the importance of being a data-driven decision-making business. The course will utilize technology to enhance the understanding of the use of data to make key business decisions in retail buying and planning.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "DSMR 310 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "DSMR 475": {
        "shortName": "DSMR 475",
        "fullName": "Design and Merchandising in the Circular Economy",
        "courseCredits": "3.0",
        "courseDesc": "This course will examine the sustainability of the fashion system from concept to consumer. Topics will include new technologies, sourcing and supply chains, business models, consumer behavior, and new roles and opportunities within the fashion system that support a circular economy.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR 477": {
        "shortName": "DSMR 477",
        "fullName": "Design and Merchandising Seminar",
        "courseCredits": "3.0",
        "courseDesc": "Provides reading and discussion of pertinent topics of current concern in the professional area of design and merchandising.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "DSMR 485": {
        "shortName": "DSMR 485",
        "fullName": "Retail and Merchandising Seminar Leadership",
        "courseCredits": "3.0",
        "courseDesc": "This course will be taught in a seminar format and feature talks from various leadership areas in the retail, merchandising, and lifestyle product areas. Topics will consider how managers and leaders must develop teams to understand corporate culture, retail management & analysis, product quality, customer service, human resources, merchandising strategies, and future goals.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "DSMR 496": {
        "shortName": "DSMR 496",
        "fullName": "Senior Problem in Design and Merchandising",
        "courseCredits": "3.0",
        "courseDesc": "Provides an opportunity for the student to research, independently or within a group, an idea within the field of design-merchandising, synthesizing material and developing a presentation of that concept.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PROD 215 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter "
    },
    "DSMR I199": {
        "shortName": "DSMR I199",
        "fullName": "Independent Study in Design & Merchandising",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR I299": {
        "shortName": "DSMR I299",
        "fullName": "Independent Study in Design & Merchandising",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR I399": {
        "shortName": "DSMR I399",
        "fullName": "Independent Study in Design & Merchandising",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR I499": {
        "shortName": "DSMR I499",
        "fullName": "Independent Study in Design & Merchandising",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR T180": {
        "shortName": "DSMR T180",
        "fullName": "Special Topics in Design & Merchandising",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR T280": {
        "shortName": "DSMR T280",
        "fullName": "Special Topics in Design & Merchandising",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "DSMR T380": {
        "shortName": "DSMR T380",
        "fullName": "Special Topics in Design & Merchandising",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Summer"
    },
    "DSMR T480": {
        "shortName": "DSMR T480",
        "fullName": "Special Topics in Design & Merchandising",
        "courseCredits": "0.5-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    }
}