{
    "EAM 130": {
        "shortName": "EAM 130",
        "fullName": "Overview of Entertainment and Arts Management",
        "courseCredits": "3.0",
        "courseDesc": "Students acquire an understanding of the profit and non-profit organization within a social and governmental context. Of primary focus are the arts organization as an entity, how they are organized and the impact and place they have within the community.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "EAM 200": {
        "shortName": "EAM 200",
        "fullName": "Introduction to the Music Industry",
        "courseCredits": "3.0",
        "courseDesc": "Introduction to the Music Industry gives students a basic overview of the commercial music business with an emphasis on its inherently changing nature and the entrepreneurial mindset that this demands of those involved in it. The goal of the course is to provide a basic introduction to four major areas of the industry: Contracts, Publishing, Touring & Booking, and Recording.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 130 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM 211": {
        "shortName": "EAM 211",
        "fullName": "Strategic Management for Entertainment and Arts Management",
        "courseCredits": "3.0",
        "courseDesc": "Explores the concepts of planning and evaluation as it relates to the arts. Instruction will focus on the development of business plans, including research, organization, competition, marketing, staffing, and financial issues (i.e. budgets, etc.). Students present and defend the elements of their plans. Other topics discussed will be leadership skills decision-making, and managing change.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "EAM 215": {
        "shortName": "EAM 215",
        "fullName": "Writing for Arts Managers",
        "courseCredits": "3.0",
        "courseDesc": "This course provides instruction and practice in a variety of written formats used in arts and entertainment. The course also covers writing for a variety of stakeholders.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 130 [Min Grade D] and EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "EAM 220": {
        "shortName": "EAM 220",
        "fullName": "Law for Entertainment and Arts Management Managers",
        "courseCredits": "3.0",
        "courseDesc": "Examines the relationship between the arts and law, including intellectual property (copyrights and contracts), license fees, labor-management and representation agreements, liability, first amendment issues, business entities and fundraising.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 221": {
        "shortName": "EAM 221",
        "fullName": "Copyrights and Trademarks",
        "courseCredits": "3.0",
        "courseDesc": "This law course for EAM students discusses topics relating to copyrights, intellectual property rights, and royalties. The course will review the basic principal tenets of copyright and trademark law and the practical aspects as applied to entertainment and arts-related issues. This course will provide you with a working knowledge of trademarks and copyrights and how these rights impact business issues in the arena of entertainment and art such as how copyright and trademark rights are created and protected, “work for hire” and related ownership issues, and how and when copyright and trademark rights are infringed.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 220 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "EAM 225": {
        "shortName": "EAM 225",
        "fullName": "Financial Management for Entertainment & Arts Managers",
        "courseCredits": "3.0",
        "courseDesc": "This course explores the major elements of financial accounting in cultural institutions. Students will learn to perform accounting tasks, read and analyze financial statements, implement an effective financial control system in the specific context of arts & cultural organizations. Student will learn how to use financial information as part of a data-informed decision-making process.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D] and EAM 130 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 270": {
        "shortName": "EAM 270",
        "fullName": "Audience Development for Arts",
        "courseCredits": "3.0",
        "courseDesc": "This course emphasizes the usefulness and application of marketing theories and concepts to develop audiences and promotes the arts as a valuable social sector, with a focus on marketing planning and strategy development. Focus is placed on marketing research, analysis, planning, strategy development, and development of marketing plans.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 288": {
        "shortName": "EAM 288",
        "fullName": "eSport Entertainment Management",
        "courseCredits": "3.0",
        "courseDesc": "As one of the fastest growing market sectors in electronic media, eSport has become an important field where entertainment management students can apply their skills. This 3-credit course explores the creation, monetization and management of eSport events.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 295": {
        "shortName": "EAM 295",
        "fullName": "Streaming Entertainment Management",
        "courseCredits": "3.0",
        "courseDesc": "Streaming is transforming the electronic media landscape and providing unique opportunities for managers. This course explores the creative genres succeeding in streaming and how streaming content is conceived, sold, produced, exhibited, and distributed worldwide.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM 301": {
        "shortName": "EAM 301",
        "fullName": "Gallery and Collection Management",
        "courseCredits": "3.0",
        "courseDesc": "Discusses the professional operation of museums and commercial art galleries including advocacy, legal, administration, curatorial, exhibition, and public issues by examining the questions: What are the challenges of managing a museum's collection including acquisition policies, insurance, conservation and storage of art? What resources are needed to manage a gallery?.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM 302": {
        "shortName": "EAM 302",
        "fullName": "Exhibition Design",
        "courseCredits": "3.0",
        "courseDesc": "Discuss key issues in exhibition presentation including visual design elements, accessibility, and approachable presentation strategies. This course also explores theoretical and ethical issues related to museums, art collecting, cultural patrimony, curatorial authority, and diversity.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM 308": {
        "shortName": "EAM 308",
        "fullName": "Entertainment Promotion and Branding",
        "courseCredits": "3.0",
        "courseDesc": "This course will provide students in-depth information about the essential area of publicity and promotion for the entertainment and arts industries. Through the art of public relations (PR), students will learn to maximize the potential for news coverage in print, electronic (radio, TV) and online sources. Focus will be placed on the process of writing for public relations and promotion in both style and content. By writing multiple drafts of biographies, press releases, pitch letters, students will hone skills to creatively present your message to media outlets, from local to international.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "EAM 310": {
        "shortName": "EAM 310",
        "fullName": "Social Media in Entertainment",
        "courseCredits": "3.0",
        "courseDesc": "Social Media In Entertainment teaches students how to develop the strategies for using social media as a marketing tool in the arts and entertainment industries. The goal will be to develop a social media strategy for a specific entity utilizing information on strategies and tactics learned during the course, as well as how to integrate this strategy into an overall marketing plan. Students will learn how to craft a strategy, how to evaluate which social media tools and tactics to use to achieve the most effective results and how to successfully implement the strategy.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM 312": {
        "shortName": "EAM 312",
        "fullName": "Introduction to Fund Development for the Arts",
        "courseCredits": "3.0",
        "courseDesc": "This course will provide an introduction to the fundraising process and initial training needs for current and future nonprofit arts organization managers. The focus is a blend of theory and practice in the areas of fund development process, organization, and communication; the primary goal is to prepare students for successfully working with or in nonprofit arts organizations in development / fundraising capacities. Our work will cover: basic sources of funding including online fundraising; board / trustee fiduciary responsibilities; trends, ethics, and innovation in fund development.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 130 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM 313": {
        "shortName": "EAM 313",
        "fullName": "Volunteer and Board Management",
        "courseCredits": "3.0",
        "courseDesc": "This course continues the work ofEAM 312- Intro to Fund Development for the Arts. It will build on that course by focusing on the area of volunteers for nonprofit organizations. Content will examine the board of directors and other volunteers in relation to governing, managing, operating a nonprofit arts entity.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 130 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "EAM 315": {
        "shortName": "EAM 315",
        "fullName": "Content Strategies for Digital Products",
        "courseCredits": "3.0",
        "courseDesc": "In this course students will understand content strategy and its business value, as well as how to audit, plan, create, deliver and manage content that effectively promotes a brand message across multiple digital channels.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 321": {
        "shortName": "EAM 321",
        "fullName": "Box Office and Venue Management",
        "courseCredits": "3.0",
        "courseDesc": "Focuses on the operational management tasks. Students explore the marketing and promotional component of box office management, the use of technology and ticket sales, and managing people.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D] and EAM 130 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "EAM 322": {
        "shortName": "EAM 322",
        "fullName": "Performing Arts Touring",
        "courseCredits": "3.0",
        "courseDesc": "Performing Arts Touring provides an overview of organizing all types of touring entertainment with a focus on the administrative and management responsibilities including booking, staffing, and decision making. Focus is placed two basic types of touring: music concert tours and performing arts tours such as Broadway shows, ballet companies, small theatrical tours, and similar arts tours. Students learn about unions, contracts, financing, logistics, promotion, ticketing, and other areas associated with arts and entertainment touring.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 130 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "EAM 325": {
        "shortName": "EAM 325",
        "fullName": "Producing for Live Entertainment",
        "courseCredits": "3.0",
        "courseDesc": "This course is experience-based and designed to familiarize students with all aspects of producing a live entertainment event and to discuss and develop the necessary skills to do so successfully through practical experience. The course provides an overview of the issues routinely encountered by producers of live events, both commercial and non-profit, through the actual producing of an arts/entertainment event. Skills developed include working creatively with artists; understanding project management, planning and budgeting; revenue projection and management (including possible fundraising); understanding technical and logistical issues around production; and successful execution.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": "EAM 130 [Min Grade D] and EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 338": {
        "shortName": "EAM 338",
        "fullName": "Entertainment Enterprise",
        "courseCredits": "3.0",
        "courseDesc": "This course challenges students to learn how to conceive, plan, build and evaluate an entertainment/media business. Expanding upon information about business ideation and formulation, this course provides students with a learning lab where they can apply theory to practice in entertainment, arts and media enterprises.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM 340": {
        "shortName": "EAM 340",
        "fullName": "Artist Representation and Management",
        "courseCredits": "3.0",
        "courseDesc": "This course gives an introduction to artist representation in the entertainment and media industry. It will cover all aspects of representation including client selection, career management and strategy for artists, agent/managers’ roles and managing your career. The course covers how the industry works both conceptually and politically. Discussions will include topics around the major entertainment companies, their work and focus, and how they compete. The course breaks down the industry into “revenue silos” in which a client can generate money.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 130 [Min Grade D] and EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "EAM 365": {
        "shortName": "EAM 365",
        "fullName": "Media and Entertainment Business",
        "courseCredits": "3.0",
        "courseDesc": "This course focuses on media networks and other major players in the media and entertainment business, examining their interdependence, and discussing major trends and tendencies on the market and their impact on the art and entertainment field.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 420": {
        "shortName": "EAM 420",
        "fullName": "Arts, Culture and Society",
        "courseCredits": "3.0",
        "courseDesc": "Arts, Culture & Society examines the role of art’s impact on society, exploring key cultural and public policy issues including community standards and censorship, and different approaches to public support and funding. Readings, videos, discussions and projects will explore questions as to the social functions of the arts, the use of art for advocacy and patronage over the world, and the impact of art on society and economic development. The geographic focus of this course is global and will compare art, including commercial entertainment and the media, and cultural practices and impacts from various cultures around the world.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 130 [Min Grade D] and EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "EAM 422": {
        "shortName": "EAM 422",
        "fullName": "Human Resources in the Creative Industries",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to give students an overview of the human resources field and to share the many ways that the creative industries conform to and diverge from human resources norms that stem from other fields. In addition to equipping students with a general understanding of how to engage with and manage staff, this course will help students become better stewards of their own careers within the industry.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 211 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "EAM 490": {
        "shortName": "EAM 490",
        "fullName": "Senior Seminar",
        "courseCredits": "3.0",
        "courseDesc": "This course serves as the finale of the student’s undergraduate education. Applying all the skills and principles learned at Drexel, each student builds a customized career toolkit and practices essential real-world skills during hands-on scenario exercises. A student may also choose to execute an independent senior capstone project as part of Senior Seminar.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "EAM 422 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "EAM I199": {
        "shortName": "EAM I199",
        "fullName": "Independent Study in Entertainment & Arts Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM I299": {
        "shortName": "EAM I299",
        "fullName": "Independent Study in Entertainment & Arts Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM I399": {
        "shortName": "EAM I399",
        "fullName": "Independent Study in Enteratinment & Arts Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 4 times for 15 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM I499": {
        "shortName": "EAM I499",
        "fullName": "Independent Study in Enteratinment & Arts Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM T180": {
        "shortName": "EAM T180",
        "fullName": "Special Topics in Entertainment & Arts Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM T280": {
        "shortName": "EAM T280",
        "fullName": "Special Topics in Entertainment & Arts Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "EAM T380": {
        "shortName": "EAM T380",
        "fullName": "Special Topics in Entertainment & Arts Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "EAM T480": {
        "shortName": "EAM T480",
        "fullName": "Special Topics in Entertainment & Arts Management",
        "courseCredits": "1.0-3.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Antoinette Westphal College of Media Arts & Design",
        "repeatStatus": "Can be repeated 5 times for 15 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    }
}