{
    "ESL 001": {
        "shortName": "ESL 001",
        "fullName": "Foundations of University Study",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language course. This course provides ESL students with a foundation for University success through developing academic communication skills and strategies and promoting awareness of the academic and co-curricular culture of the American university.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 002": {
        "shortName": "ESL 002",
        "fullName": "Foundations of Academic Writing",
        "courseCredits": "0.0",
        "courseDesc": "This course introduces ESL students to the academic essay and the process approach to writing as well as reading for different purposes.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 003": {
        "shortName": "ESL 003",
        "fullName": "Foundations of Academic Reading",
        "courseCredits": "0.0",
        "courseDesc": "This course introduces ESL students to the skills of critical reading for information, specifically summarizing and evaluating source material.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 004": {
        "shortName": "ESL 004",
        "fullName": "International Gateway Foundations of Academic Writing for Chemistry 201",
        "courseCredits": "0.0",
        "courseDesc": "This course provides International Gateway students with support for success in theCHEM 201course through developing academic skills and strategies to participate in the sciences.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 005": {
        "shortName": "ESL 005",
        "fullName": "Reading and Vocabulary I",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 1 is a foundational English as a second language course (CEFR Level A1), which is designed to prepare students to read phrases and simple sentences related to everyday life. Successful completion of this course is necessary to enroll in the next level.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "ESL 006": {
        "shortName": "ESL 006",
        "fullName": "Writing and Grammar I",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 1 is an introductory English as a second language course (CEFR Level A1), which is designed to introduce students to basic grammar and sentences.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 010": {
        "shortName": "ESL 010",
        "fullName": "Listening and Speaking I",
        "courseCredits": "0.0",
        "courseDesc": "Low beginning English as a second language. Provides intensive instruction in the development of the following skills: speaking and listening in everyday situations, vocabulary, pronunciation, and grammatical functions. Placement testing is required. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 012": {
        "shortName": "ESL 012",
        "fullName": "English in Everyday Life",
        "courseCredits": "0.0",
        "courseDesc": "Low beginning English as a second language. Prepares students who have trouble talking with and understanding native English speakers in everyday situations such as going to the store or the bank, asking for directions, using the telephone, etc. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 013": {
        "shortName": "ESL 013",
        "fullName": "Beginning Grammar",
        "courseCredits": "0.0",
        "courseDesc": "Beginning English as a second language. Provides instruction and practice in such areas of English grammar as simple verb tenses, sentence structure, modals, and irregular verbs. Placement testing is required. Offered all terms.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 020": {
        "shortName": "ESL 020",
        "fullName": "Listening and Speaking II",
        "courseCredits": "0.0",
        "courseDesc": "High beginning English as a second language. Provides intensive instruction in the development of the following skills: speaking and listening (participating actively in spoken interactions and responding appropriately), vocabulary related to topics in the course, pronunciation and intonation patterns, and grammatical functions. Placement testing is required. Offered all terms. The course meets 7.5 hours per week.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 021": {
        "shortName": "ESL 021",
        "fullName": "Reading and Writing II",
        "courseCredits": "0.0",
        "courseDesc": "High beginning English as a second language. Provides intensive instruction in the development of the following skills: reading comprehension, inferring, vocabulary development, non-academic paragraph writing, basic grammatical structures and mechanics, and the ability to communicate ideas orally and in writing. Placement testing is required. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 022": {
        "shortName": "ESL 022",
        "fullName": "Pronunciation and Conversation",
        "courseCredits": "0.0",
        "courseDesc": "High beginning to low intermediate English as a second language. Emphasizes vocabulary, pronunciation, and idioms. Gives students a chance to improve and practice their spoken communication skills. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 023": {
        "shortName": "ESL 023",
        "fullName": "Intermediate Grammar III",
        "courseCredits": "0.0",
        "courseDesc": "Low intermediate English as a second language course. Provides instruction and practice in such areas as present, past, and future tense verbs, question structures, nouns and pronouns, and modals. Placement testing is required. Offered as needed. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 024": {
        "shortName": "ESL 024",
        "fullName": "Presentations with Stories & Legends",
        "courseCredits": "0.0",
        "courseDesc": "Beginning to low intermediate. English as a second language. Provides instruction and practice in reading comprehension, writing, listening, and presentations using stories from a variety of sources. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 025": {
        "shortName": "ESL 025",
        "fullName": "Reading and Vocabulary II",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 2 is a low-beginner English as a second language course (CEFR Level A2), which is designed to prepare students to read basic texts related to everyday life. Successful completion of this course is necessary to enroll in the next level. Classes meet 6 hours per week.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 026": {
        "shortName": "ESL 026",
        "fullName": "Writing and Grammar II",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 2 is a beginner English as a second language course (CEFR Level A2), which is designed to prepare students to write basic discourse using simple and progressive tenses. Classes meet 7.5 hours per week.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 029": {
        "shortName": "ESL 029",
        "fullName": "Writing and Grammar III",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 3 is a high-beginner English as a second language course (CEFR Level A2+), which is designed to prepare students to write short paragraphs using simple and progressive tenses. Classes meet 7.5 hours per week.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 030": {
        "shortName": "ESL 030",
        "fullName": "Listening and Speaking III",
        "courseCredits": "0.0",
        "courseDesc": "Low intermediate English as a second language. Provides intensive instruction in the development of the following skills: pronunciation (sounds, stress, intonation), vocabulary, listening/speaking (participating and responding appropriately in discussions, following directions, completing listening activities), grammatical competence, and repair of communication breakdown. Placement testing is required. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 031": {
        "shortName": "ESL 031",
        "fullName": "Reading and Writing III",
        "courseCredits": "0.0",
        "courseDesc": "Low intermediate English as a second language. Provides intensive instruction in the development of the following skills: reading comprehension, inferring, vocabulary development, academic paragraph and essay format, grammatical structures and mechanics, and the ability to communicate ideas orally and in writing. Placement testing is required. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 032": {
        "shortName": "ESL 032",
        "fullName": "English for Business Purposes",
        "courseCredits": "0.0",
        "courseDesc": "Intermediate English as a second language. Provides communication skills needed to do business with English speakers. Topics include small talk and telephone skills, participation in business meeting, presentations, communication through business letters and memos, and business negotiation. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 034": {
        "shortName": "ESL 034",
        "fullName": "Understanding the News Media",
        "courseCredits": "0.0",
        "courseDesc": "Intermediate to advanced English as a second language. Emphasizes listening, discussion, and reading skills as students learn to read newspaper articles and listen to news from a variety of sources. Provides instruction on how the news is made and evaluated. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 035": {
        "shortName": "ESL 035",
        "fullName": "Intermediate Vocabulary Development",
        "courseCredits": "0.0",
        "courseDesc": "Intermediate English as a second language course. Provides strategies to improve academic, general, and technical vocabulary; to discover common roots in English words; and to improve reading skills. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 036": {
        "shortName": "ESL 036",
        "fullName": "TOEFL iBT Listening & Speaking",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language. Prepares students to take the Internet-based TOEFL (Test of English as a Foreign Language) for academic purposes. Provides instruction in the listening and speaking sections of the TOEFL. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 037": {
        "shortName": "ESL 037",
        "fullName": "Intermediate Grammar IV",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate English as a second language course. Provides instruction and practice in such areas as comparative structures, passive voice, gerunds and infinitives, and clause structures. Placement testing is required. Offered as needed. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 038": {
        "shortName": "ESL 038",
        "fullName": "Intermediate Exploring American Life & Language",
        "courseCredits": "0.0",
        "courseDesc": "Intermediate English as a second language course. Students evaluate aspects of United States culture and history as presented in selected drama, literature, and music. Additional presentations and writing assignments support development of fluency in speaking and writing skills. Placement testing for this course is required. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 039": {
        "shortName": "ESL 039",
        "fullName": "Reading and Vocabulary III",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 3 is a high-beginner English as a second language course (CEFR Level A2+), which is designed to prepare students to read and comprehend topics related to everyday life. Successful completion of this course is necessary to enroll in the next level. This is the third course in an eight-course sequence on developing academic reading skills. Students have to complete level two or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Classes meet 6 hours per week.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 040": {
        "shortName": "ESL 040",
        "fullName": "Listening and Speaking IV",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate English as a second language. Provides intensive instruction in the development of the following skills: pronunciation/fluency (sounds, stress, intonation, linking, phrasing), vocabulary, listening/speaking (participate appropriately in spoken interactions, understand news, mini-lectures), repair of communication breakdown, and grammatical competence. Placement testing is required. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 041": {
        "shortName": "ESL 041",
        "fullName": "Writing and Grammar 4",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 4 is a low-intermediate English as a second language course (CEFR Level B1), which is designed to prepare students to write extended paragraphs in several common modes. This is the fourth course in an eight-course sequence on developing writing skills. Students have to complete level three or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 042": {
        "shortName": "ESL 042",
        "fullName": "Reading and Vocabulary 4",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 4 is a low-intermediate English as a second language course (CEFR Level B1), which is designed to prepare students to read and comprehend adapted basic readings. This is the fourth course in an eight-course sequence on developing academic reading skills. Students have to complete level three or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 6-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 043": {
        "shortName": "ESL 043",
        "fullName": "Intermediate Presentation Skills",
        "courseCredits": "0.0",
        "courseDesc": "Intermediate English as a second language course. Provides instruction on preparing, delivering, and evaluating presentations. Explores ways to engage audience and improve performance. Builds confidence through speaking skill development. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 044": {
        "shortName": "ESL 044",
        "fullName": "Skills for College Success",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language. Addresses academic skills topics such as listening to lectures and note taking, reading textbooks and synthesizing information, conducting research, and expanding awareness of the United States academic environment. Placement testing is required. Offered all terms.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 045": {
        "shortName": "ESL 045",
        "fullName": "TOEIC Preparation 4-6",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language. Introduces skills and strategies that are helpful in taking the TOEIC test. Improves listening and reading comprehension skills. Focuses on analyzing types of test questions commonly asked and learning strategies for answering the questions. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 048": {
        "shortName": "ESL 048",
        "fullName": "TOEFL iBT  Reading & Writing",
        "courseCredits": "0.0",
        "courseDesc": "High Intermediate to advanced English as a second language. Prepares students to take the Internet Based TOEFL (Test of English as a Foreign Language) for academic purposes. Provides instruction in the reading and writing sections of the TOEFL. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 049": {
        "shortName": "ESL 049",
        "fullName": "Intermediate Pronunciation and Conversation",
        "courseCredits": "0.0",
        "courseDesc": "Intermediate English as a second language course. Provides instruction on pronunciation, word stress, and intonation. Gives students a chance to improve and practice their spoken communication skills. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 050": {
        "shortName": "ESL 050",
        "fullName": "Listening and Speaking V",
        "courseCredits": "0.0",
        "courseDesc": "Low advanced English as a second language. Provides intensive instruction in the development of the following skills: pronunciation/fluency (ease, speed, smoothness of speaking), vocabulary, listening/speaking (participate appropriately in spoken interactions, understand news reports, lectures), repair of communication breakdown, and grammatical competence. Placement testing is required. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 051": {
        "shortName": "ESL 051",
        "fullName": "Writing and Grammar 5",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 5 is an intermediate English as a second language course (CEFR Level B1+), which is designed to prepare students to write multi-draft five-paragraph essays in several common modes. This is the fifth course in an eight-course sequence on developing writing skills. Students have to complete level four or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 052": {
        "shortName": "ESL 052",
        "fullName": "Reading and Vocabulary 5",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 5 is an intermediate English as a second language course (CEFR Level B1+), which is designed to prepare students to read and respond to adapted readings. This is the fifth course in an eight-course sequence on developing academic reading skills. Students have to complete level four or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 6-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 055": {
        "shortName": "ESL 055",
        "fullName": "Strategies for Academic Reading",
        "courseCredits": "0.0",
        "courseDesc": "Advanced English as a second language. Improves reading comprehension. Provides skills for defining and identifying main and supporting ideas, recognizing transitional words and their role in meaning, and finding organizational patterns. Explores the authors' purpose, opinion, and tone. Placement testing is required. Offered as needed. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 056": {
        "shortName": "ESL 056",
        "fullName": "GMAT Preparation 5-6",
        "courseCredits": "0.0",
        "courseDesc": "Advanced English as a second language. Provides instruction for GMAT reading. Offers strategies to identify key parts of an argument and reviews grammatical and stylistic rules in the sentence correction section. Analyses arguments. Provides instruction for essay writing. Placement testing is required. Offered as needed. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 057": {
        "shortName": "ESL 057",
        "fullName": "Advanced Vocabulary and Idioms",
        "courseCredits": "0.0",
        "courseDesc": "Advanced English as a second language. Provides strategies to improve idiomatic language using authentic sources from a variety of media. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 058": {
        "shortName": "ESL 058",
        "fullName": "Advanced Exploring American Life & Language",
        "courseCredits": "0.0",
        "courseDesc": "Advanced English as a second language course. Students evaluate aspects of United States culture and history as presented in selected drama, literature, and music. Additional presentations and writing assignments support development of fluency in speaking and writing skills. Placement testing for this course is required. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 060": {
        "shortName": "ESL 060",
        "fullName": "Listening and Speaking VI",
        "courseCredits": "0.0",
        "courseDesc": "Advanced English as a second language. Provides intensive content-based instruction in the development of the following skills: pronunciation/fluency (ease, speed, smoothness of speaking), vocabulary, listening/speaking (participate appropriately in spoken interactions, understand news reports, lectures), grammatical competence, repair of communication breakdown. Placement testing is required. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 061": {
        "shortName": "ESL 061",
        "fullName": "Writing and Grammar 6",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 6 is an intermediate English as a second language course (CEFR Level B2), which is designed to prepare students to write extended multi-draft essays in a variety of different modes. This is the sixth course in an eight-course sequence on developing writing skills. Students have to complete level five or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 062": {
        "shortName": "ESL 062",
        "fullName": "Reading and Vocabulary 6",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 6 is an intermediate English as a second language course (CEFR Level B2), which is designed to prepare students to read and respond to adapted readings. This is the sixth course in an eight-course sequence on developing academic reading skills. Students have to complete level five or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 6-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 063": {
        "shortName": "ESL 063",
        "fullName": "Advanced Grammar VI",
        "courseCredits": "0.0",
        "courseDesc": "High advanced English as a second language course. Provides instruction and practice in such areas as usage of passive tense, noun clauses, adjective clauses, gerunds and infinitives, and conditional sentences. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 064": {
        "shortName": "ESL 064",
        "fullName": "Advanced Presentation Skills",
        "courseCredits": "0.0",
        "courseDesc": "Advanced English as a second language course. Provides instruction on preparing, delivering, and evaluating presentations. Explores ways to engage audience and improve performance. Builds confidence through speaking skill development. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 067": {
        "shortName": "ESL 067",
        "fullName": "Language of Science Technology Engineering and Mathematics",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language course. Provides instruction on building academic vocabulary, reading, and oral skills by incorporating authentic materials from a variety of STEM (Science, Technology, Engineering & Math) fields.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 068": {
        "shortName": "ESL 068",
        "fullName": "Language of Media and Design",
        "courseCredits": "0.0",
        "courseDesc": "High Intermediate-Advanced Listening & Speaking. Develops English as a second language communicative fluency in design-related concepts and vocabulary through the use of authentic materials and experiences.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 069": {
        "shortName": "ESL 069",
        "fullName": "Advanced Pronunciation and Conversation",
        "courseCredits": "0.0",
        "courseDesc": "Advanced Intermediate English as a second language course. Provides instruction on pronunciation, word stress, and intonation. Gives students a chance to improve and practice their spoken communication skills. Placement testing is required. Offered all terms. 3-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 070": {
        "shortName": "ESL 070",
        "fullName": "Listening and Speaking 7",
        "courseCredits": "0.0",
        "courseDesc": "Listening and Speaking level 7 is a high-intermediate English as a second language course (CEFR Level B2+), which is designed to provide intensive instruction in the development of aural and oral skills necessary for academic discussions and presentations. This is the seventh course in an eight-course sequence on developing academic listening and speaking skills. Students have to complete level six or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 071": {
        "shortName": "ESL 071",
        "fullName": "Writing and Grammar 7",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 7 is a high-intermediate English as a second language course (CEFR Level B2+), which is designed to prepare students to transition into academic writing. This is the seventh course in an eight-course sequence on developing writing skills. Students have to complete level six or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 072": {
        "shortName": "ESL 072",
        "fullName": "Reading and Vocabulary 7",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 7 is a high-intermediate English as a second language course (CEFR Level B2+), which is designed to prepare students to read and analyze extended articles written for a general audience. This is the seventh course in an eight-course sequence on developing academic reading skills. Students have to complete level six or take a placement exam before taking this course. Successful completion of this course is necessary to enroll in the next level. Offered all terms.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 073": {
        "shortName": "ESL 073",
        "fullName": "Introduction to Business Research",
        "courseCredits": "0.0",
        "courseDesc": "High-intermediate to advanced level English as a second language. Introduces students to the research process of business related topics and exposes them to American culture and conversation through interaction. Offered as needed. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 074": {
        "shortName": "ESL 074",
        "fullName": "IELTS Listening and Speaking",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language. Prepares students to take the IELTS (International English Language Testing System) for academic and professional purposes. Provides instruction in the listening and speaking sections of the IELTS test. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 075": {
        "shortName": "ESL 075",
        "fullName": "IELTS Reading and Writing",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language. Prepares students to take the IELTS (International English Language Testing System) for academic and professional purposes. Provides instruction in the reading and writing sections of IELTS. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 076": {
        "shortName": "ESL 076",
        "fullName": "IELTS (International English Language Testing System) Test Preparation All Skills",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language. Prepares students to take the IELTS (International English Language Testing System) for academic and professional purposes. Provides instruction in the listening, speaking, reading, and writing sections of the IELTS test. Placement testing is required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 080": {
        "shortName": "ESL 080",
        "fullName": "Listening and Speaking 8",
        "courseCredits": "0.0",
        "courseDesc": "Listening and Speaking level 8 is an advanced English as a second language course (CEFR Level C1), which is designed to prepare students to acquire aural and oral skills for academic discussions and presentations at the undergraduate or graduate level. This is the final course in an eight-course sequence on developing listening and speaking skills. Students have to complete level seven or take a placement exam before taking this course. Successful completion of this course will result in the successful completion of the IEP listening and speaking. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 081": {
        "shortName": "ESL 081",
        "fullName": "Writing and Grammar 8",
        "courseCredits": "0.0",
        "courseDesc": "Writing and Grammar level 8 is an advanced English as a second language course (CEFR Level C1), which is designed to prepare students to write at the undergraduate or graduate level. This is the final course in an eight-course sequence on developing writing skills. Students have to complete level seven or take a placement exam before taking this course. Successful completion of this course will result in completion of IEP writing and grammar. Offered all terms. 7.5-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 082": {
        "shortName": "ESL 082",
        "fullName": "Reading and Vocabulary 8",
        "courseCredits": "0.0",
        "courseDesc": "Reading and Vocabulary level 8 is an advanced English as a second language course (CEFR Level C1), which is designed to prepare students to read academic texts for undergraduate and graduate study. This is the final course in an eight-course sequence on developing academic reading skills. Students have to complete level seven or take a placement exam before taking this course. Successful completion of this course will result in completion of IEP reading and vocabulary. Offered all terms. 6-0-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 088": {
        "shortName": "ESL 088",
        "fullName": "Application Process",
        "courseCredits": "0.0",
        "courseDesc": "Application Process is an intermediate to advanced course that provides instruction on how to apply to a U.S. college or university. International students who are nonnative speakers of English are the target audience. This 4-week online course is designed for Oman Ministry of Higher Education scholarship recipients and is not part of any degree program.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 089": {
        "shortName": "ESL 089",
        "fullName": "Writing for the Application",
        "courseCredits": "0.0",
        "courseDesc": "Writing for the Application is an intermediate to advanced course that provides instruction in writing personal narrative essays for applying to colleges and universities. This course is designed to introduce content development strategies as well as essay analysis and writing proficiency that can transfer to improved personal narrative writing skills. Classes meet 7.5 hours per week.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 090": {
        "shortName": "ESL 090",
        "fullName": "English for Medical Purposes",
        "courseCredits": "0.0",
        "courseDesc": "High intermediate to advanced English as a second language. Develops participants' communication skills in medical context. Provides an overview of the American healthcare system and the dynamics of the different participants involved in the system. Placement testing is necessary. Offered as needed. 2.5-2.5-0.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 091": {
        "shortName": "ESL 091",
        "fullName": "Special Topics in English Language & Culture",
        "courseCredits": "0.0-10.0",
        "courseDesc": "This course is a beginning to advanced English as a second language course. The focus is on specific issues in English structure and usage. It includes issues of discourse, sociolinguistics, and culture. The course may run from 1 to 10 weeks depending on special program cohort needs. Topics may vary.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 096": {
        "shortName": "ESL 096",
        "fullName": "Technology and Digital Literacy Academic Fulbright Program",
        "courseCredits": "0.0",
        "courseDesc": "This hands-on course walks participants through the different phases of research and helps them utilize technological software applications to help with and enrich each research phase of a given project – whether that be a presentation on a teaching skill or a research paper on specified subject content. This course will develop and refine skills with the use of tools that aid in deep brainstorming, organizing ideas, organizing and storing references, accurately formatting references, visualizing data, storytelling and collaborating – all skills that will play a key role in scholars’ Fulbright journeys.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 097": {
        "shortName": "ESL 097",
        "fullName": "Research and Writing Course Academic Fulbright Program",
        "courseCredits": "0.0",
        "courseDesc": "This course will develop participants’ skills in research and writing required for graduate level work. The theme is The Bill of Rights and participants are required to: brainstorm multidisciplinary topic areas for research; create research questions; develop primary research protocols (i.e. questionnaires); research secondary sources through web-based research methods; synthesize research; write a paper in groups (approximately 5-7 pages) describing the research design and significant findings, and display the concept of their project for a viewing audience from the Drexel University community.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 098": {
        "shortName": "ESL 098",
        "fullName": "Communicating Effectively in the American Classroom",
        "courseCredits": "0.0",
        "courseDesc": "This course focuses on developing participants’ skills for communicating effectively in the U.S. graduate classroom, in particular participating in the forms of oral language such as that needed for understanding lectures, interacting in and leading class discussions, and making academic presentations. Assignments will include: listening and taking notes to lectures, preparing for and contributing to class discussions based on readings, and observing academic lectures and analyzing American classroom dynamics.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 099": {
        "shortName": "ESL 099",
        "fullName": "Challenges in American Culture",
        "courseCredits": "0.0",
        "courseDesc": "This course uses readings, interactive discussions, role-plays, and other methods to address both immediate and longer-term acculturation concerns. The first focus is participants’ immediate needs regarding health and wellness, safety, housing, and transportation. Initial sessions will also cover foreign student rights in the U.S., healthcare and resources, and J-visa responsibilities. Other topics to be covered: questions emerging from participants’ early experiences in the United States; key cultural values such as individualism, egalitarianism, and self-reliance and their impact on communication patterns; non-verbal communication; Academic culture in the U.S.; the history of immigration to Philadelphia; issues and “hot topics” in U.S. political, religious, and social life; and the US Bill of Rights.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "ESL 110": {
        "shortName": "ESL 110",
        "fullName": "Introduction to Academic Discourse",
        "courseCredits": "3.0",
        "courseDesc": "The course prepares students for courses requiring English academic communication. The course provides a review of English grammar, an introduction to academic writing,reading, and academic support services. Opportunities to interact with other members of the university community are provided. By departmental approval only.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "ESL 180": {
        "shortName": "ESL 180",
        "fullName": "Topics in English for Academic Purposes",
        "courseCredits": "2.0",
        "courseDesc": "This course focuses on the academic discourse of a particular genre and/or content area in English for Specific Purposes or English for Academic Purposes.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 5 times for 12 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    }
}