{
    "GEO 101": {
        "shortName": "GEO 101",
        "fullName": "Physical Geology",
        "courseCredits": "4.0",
        "courseDesc": "This course is an introduction to geology emphasizing the role of plate tectonics. Topics include formation of minerals, igneous, sedimentary, and metamorphic rocks, volcanoes, earthquakes, depositional environments, and geological hazards. Labs focus on mineral and rock identification, map skills, and 3D visualization.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 102": {
        "shortName": "GEO 102",
        "fullName": "History of the Earth",
        "courseCredits": "4.0",
        "courseDesc": "The history of the earth and the evolution of life on earth are examined. Geological and biological processes that allow us to reconstruct the past are emphasized. Topics include geologic time, plate tectonics, and the nature of the fossil record. Lab exercises include hands-on fossil identification and the use of fossils as tools to explore the history of the earth.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 103": {
        "shortName": "GEO 103",
        "fullName": "Introduction to Field Methods in Earth Science",
        "courseCredits": "2.0",
        "courseDesc": "This is an introductory course in earth science that provides experience with the fundamental skills and methods for the field study of the earth and earth processes.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 111": {
        "shortName": "GEO 111",
        "fullName": "Natural Disasters",
        "courseCredits": "3.0",
        "courseDesc": "This course is an overview of natural disasters and hazards. Students will learn the geology behind major natural disasters and how society best mitigates risk. Topics include volcanoes, earthquakes, tsunamis, hurricanes, and floods. Students will review case studies of past (and any concurrent) natural disasters through journal articles and media coverage.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 201": {
        "shortName": "GEO 201",
        "fullName": "Earth Systems Processes",
        "courseCredits": "3.0",
        "courseDesc": "Students will examine local and global environmental changes from an earth systems perspective. Important concepts include feed-back loops, tipping points, the \"butterfly effect,\" and geological time. From a geological perspective, students will examine: natural and anthropogenic climate change; soil degradation; sea-level rise; plate tectonics; and natural hazards, such as coastal storms, levee breaks, earthquakes, tsunamis, landslides and more.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 205": {
        "shortName": "GEO 205",
        "fullName": "Dinosaurs and Their World",
        "courseCredits": "3.0",
        "courseDesc": "An introduction to dinosaur paleontology, this course focuses on the scientific method as applied to dinosaur studies. Topics include dinosaur evolution, the history of dinosaur research, an overview of dinosaurs, and birds as living dinosaurs. This is suitable for all majors.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 207": {
        "shortName": "GEO 207",
        "fullName": "Introduction to Oceanography",
        "courseCredits": "3.0",
        "courseDesc": "This course provides a topics-based approach to the field of Oceanography and its disciplines. Provides a solid understanding of the discipline of oceanography and a foundation to pursue further advanced topics in oceanography or to learn about how our planet works.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 215": {
        "shortName": "GEO 215",
        "fullName": "Mineralogy",
        "courseCredits": "4.0",
        "courseDesc": "In this course, students will study mineralogy and optical mineralogy, with a focus on describing minerals within their geologic context. The foundations of mineralogy will be covered, including: crystallography, chemical bonding, controls on mineral structure, mineral stability, and crystal growth. Students will learn physical and chemical analytical methods to examine mineral composition and structure. Hand-sample identification will be emphasized in the laboratory component. In the field, students will learn to identify rock-forming minerals within the context of historical geological events.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "CHEM 101 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 301": {
        "shortName": "GEO 301",
        "fullName": "Advanced Field Methods in Earth Science",
        "courseCredits": "3.0",
        "courseDesc": "This skills course focuses on fundamental and commonly used geoscience field techniques. Students will learn surface and subsurface mapping, coring techniques and core analysis, remote sensing techniques, and sampling techniques. This course builds onGEO 103and prepares students for advanced field studies.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(GEO 101 [Min Grade D] or CAEE 212 [Min Grade D]) and GEO 103 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 306": {
        "shortName": "GEO 306",
        "fullName": "Environmental Geology",
        "courseCredits": "4.0",
        "courseDesc": "Students in this course will focus on interactions between humans and the geosphere. Students will develop an understanding of a broad range of natural and human-induced geohazards, from earthquakes and tsunamis to industrial pollution and anthropogenic climate change. Regional examples will be emphasized, such environmental industrial contamination and remediation efforts in the Delaware Valley and hydraulic fracturing for natural gas in Pennsylvania.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "GEO 101 [Min Grade D] or CAEE 212 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 309": {
        "shortName": "GEO 309",
        "fullName": "Geochemistry",
        "courseCredits": "4.0",
        "courseDesc": "This course is a topics-based approach to the field of geochemistry with emphasis on aqueous systems, both marine and freshwater. Topics include: composition of the earth and oceans; chemical equilibrium; solubility; thermodynamics; oxidation-reduction reactions; organic geochemistry; isotope geochemistry; contaminant geochemistry; applications of geochemistry; consequences of weathering; composition of surface waters; geochemical modeling; and selected areas of interest.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "CHEM 103 [Min Grade D] or CHEM 123 [Min Grade D] or CHEM 102 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 312": {
        "shortName": "GEO 312",
        "fullName": "Sedimentology and Stratigraphy",
        "courseCredits": "3.5",
        "courseDesc": "This course focuses on clastic and carbonate depositional environments and processes, stratigraphic principles, the construction of the stratigraphic columns, and sedimentary basin analysis.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "GEO 101 [Min Grade D] or CAEE 212 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 320": {
        "shortName": "GEO 320",
        "fullName": "Invertebrate Paleobiology and Paleoecology",
        "courseCredits": "3.5",
        "courseDesc": "This course focuses on the evolution, ecology, and environmental interactions of invertebrates with hard parts from the Cambrian period to today. Topics include paleoecology, paleodiversity, mass extinction, taphonomy, biostratigraphy, and taxonomy. Natural selection, functional morphology, extinction and adaption are emphasized.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BIO 124 [Min Grade D] or BIO 132 [Min Grade D] or BIO 141 [Min Grade D] or BIO 109 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 322": {
        "shortName": "GEO 322",
        "fullName": "Vertebrate Paleontology",
        "courseCredits": "4.0",
        "courseDesc": "This course focuses on the evolution of vertebrates from the Cambrian Period to today. Topics include cartilaginous and bony fishes, amphibians, turtles, crocodiles, pterosaurs, birds, and mammals. Natural selection, cladistics, functional morphology, adaptation and extinction are emphasized.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BIO 124 [Min Grade D] or BIO 132 [Min Grade D] or (BIO 109 [Min Grade D] or BIO 141 [Min Grade D])",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 325": {
        "shortName": "GEO 325",
        "fullName": "Structural Geology",
        "courseCredits": "5.0",
        "courseDesc": "Students in this course will explore the physical and geometric structures within the earth's crust and the ways in which these structures reflect natural history. Mapping techniques and methods of describing stress and strain in rocks will be covered, while emphasizing visualization of three-dimensional relationships. Students will learn practical analytical techniques and foundational field skill. This course is at the heart of field geology and will prepare students for a successful summer field camp experience.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "GEO 101 [Min Grade D] or CAEE 212 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 342": {
        "shortName": "GEO 342",
        "fullName": "Geomorphology",
        "courseCredits": "4.0",
        "courseDesc": "Students in this course will learn how landscapes originate and develop over time, through an integrative approach that covers all of the major constructional and erosional processes. The fundamentals of sediment entrainment, transport, and deposition will be applied to landform evolution. Students will learn about the importance of geomorphology in environmental geology.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "GEO 101 [Min Grade D] or CAEE 212 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 346": {
        "shortName": "GEO 346",
        "fullName": "Coastal Geology",
        "courseCredits": "4.0",
        "courseDesc": "This course will furnish an understanding of the tectonic framework, hydrographic regime, climatic setting, and geological components that determine the morphology and behavior of coastlines. The response of coasts to changes in sea level, sediment supply, and human development will be examined. Fundamental geomorphic processes, such as wave-driven currents and tidal dynamics, will be covered.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "GEO 101 [Min Grade D] or CAEE 212 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 348": {
        "shortName": "GEO 348",
        "fullName": "Oceanography",
        "courseCredits": "4.0",
        "courseDesc": "This course provides a topics-based approach to the field of oceanography with special emphasis on marine geology and geochemistry. Provides a solid understanding of the discipline of oceanography and a foundation to pursue further advanced topics in oceanography.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "GEO 101 [Min Grade D] or CHEM 101 [Min Grade D] or CAEE 212 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 350": {
        "shortName": "GEO 350",
        "fullName": "Volcanology",
        "courseCredits": "3.0",
        "courseDesc": "Volcanology is a study of the origin, properties, and processes involved in the formation and eruption of volcanoes. The student taking this course will be introduced to the various types of volcanism on Earth and in the Solar System, methods of volcano monitoring, and human and environmental impacts of volcanic eruptions.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO 375": {
        "shortName": "GEO 375",
        "fullName": "Field Camp",
        "courseCredits": "3.0",
        "courseDesc": "This is a one-week field course designed to prepare students for successful careers in the geosciences. Course emphasizes scientific methodology and traditional techniques that provide a strong foundation for the broad range of modern technologies used by today’s industry, academic, government and private workforces. Students learn to collect field observations and measurements, compile detailed rock descriptions, measure stratigraphic sections, and construct geologic maps and cross sections. This course is repeatable for credit.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 2 times for 9 credits",
        "prereqs": "GEO 101 [Min Grade D] and GEO 103 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 401": {
        "shortName": "GEO 401",
        "fullName": "Igneous and Metamorphic Petrology",
        "courseCredits": "5.0",
        "courseDesc": "Students in this course will explore the processes that control the genesis of igneous and metamorphic rocks, with emphasis on igneous processes. In the laboratory portion of the course students will learn identification and classification of petrographic specimens. Students will gain hand-on experience identifying igneous and metamorphic rocks in the field.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(GEO 101 [Min Grade D] or CAEE 212 [Min Grade D]) and CHEM 102 [Min Grade D] and GEO 215 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 412": {
        "shortName": "GEO 412",
        "fullName": "Geology of Groundwater",
        "courseCredits": "4.0",
        "courseDesc": "Students in this course will learn the theoretical basis and practical techniques of hydrogeology. The significance of groundwater for ecosystem health, including human well-being, will be emphasized. Students will learn commonly used industrial techniques, such as hydrograph analyses, borehole measurements, and stream gauge techniques and will gain hands-on experience assessing hydrogeology in the field.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "CHEM 102 [Min Grade D] and (MATH 239 [Min Grade D] or MATH 123 [Min Grade D])",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 418": {
        "shortName": "GEO 418",
        "fullName": "Geophysics",
        "courseCredits": "4.0",
        "courseDesc": "Students in this course will learn geophysical concepts and practical (and marketable) skills for using geophysical techniques in the field. Students will gain hands-on experience in seismic profiling, borehole logging and other techniques important in environmental consulting and the energy industry.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(MATH 239 [Min Grade D] or MATH 123 [Min Grade D]) and (PHYS 153 [Min Grade D] or PHYS 102 [Min Grade D])",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 444": {
        "shortName": "GEO 444",
        "fullName": "Plate Tectonics",
        "courseCredits": "3.0",
        "courseDesc": "Plate tectonics is one of the Earth Sciences' foundational theories, underlying much of our understanding on the origin and distribution of volcanoes, earthquakes, ocean basins, and mountain chains. This course discusses vector analysis approaches as they apply to plate tectonics theory, plate rotation poles, analysis of triple-junction stability, mantle flow, plate motion reconstructions, and the driving forces of plate tectonics.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "GEO 101 [Min Grade D] or CAEE 212 [Min Grade D] and MATH 101 [Min Grade D] or MATH 121 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "GEO 497": {
        "shortName": "GEO 497",
        "fullName": "Research",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Students pursue a specific area of research in geoscience under the direction of a geoscience faculty member. Faculty permission required.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO I199": {
        "shortName": "GEO I199",
        "fullName": "Independent Study in GEO",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO I299": {
        "shortName": "GEO I299",
        "fullName": "Independent Study in GEO",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO I399": {
        "shortName": "GEO I399",
        "fullName": "Independent Study in GEO",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO I499": {
        "shortName": "GEO I499",
        "fullName": "Independent Study in GEO",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO T180": {
        "shortName": "GEO T180",
        "fullName": "Special Topics in Geoscience",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO T280": {
        "shortName": "GEO T280",
        "fullName": "Special Topics in Geoscience",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO T380": {
        "shortName": "GEO T380",
        "fullName": "Special Topics in Geoscience",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "GEO T480": {
        "shortName": "GEO T480",
        "fullName": "Special Topics in Geoscience",
        "courseCredits": "0.0-12.0",
        "courseDesc": "In this course, students will explore specific areas not covered in the regularly offered Geoscience courses. The course will be taught by teaching faculty members of the Geoscience Program, Drexel professors who are members of the Geoscience Faculty Committee, or by visiting professors.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    }
}