{
    "HSCI 101": {
        "shortName": "HSCI 101",
        "fullName": "Anatomy and Physiology I",
        "courseCredits": "5.0",
        "courseDesc": "This course is a general study of the structures and physiology of the human body. Fundamental concepts of microscopic tissue structure, gross structures of organs and body system organization are taught. The course consists of both lecture and lab material. The lecture portion deals with the general principles. In the lab, the student participates with practical examination of microscopic sections, tissues and organs, and the anatomical layout of human cadavers. The cell, tissues and musculoskeletal system will be covered in this course, as well as muscle and nerve physiology.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter "
    },
    "HSCI 102": {
        "shortName": "HSCI 102",
        "fullName": "Anatomy and Physiology II",
        "courseCredits": "5.0",
        "courseDesc": "This course is a continuation ofHSCI 101. This course is a general study of the structures & physiology of the human body. Fundamental concepts of microscopic tissue structure, gross structures of organs and body system organization are taught. The course consists of both lab and lecture material. The lecture deals with the general principles. In the lab, the student participates with practical examination of microscopic sections, tissues and organs, and the anatomical layout of various animal cadavers. The nervous, endocrine and digestive system will be covered in this course.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 101 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Spring "
    },
    "HSCI 103": {
        "shortName": "HSCI 103",
        "fullName": "Anatomy and Physiology III",
        "courseCredits": "5.0",
        "courseDesc": "This is the third in a series of three lecture and laboratory courses that present a general study of human anatomy and physiology, including microscopic and gross anatomy. The course is designed as a foundational course for students pursing health professions. In laboratory/recitation sessions students examine anatomical models and materials from human cadavers and apply knowledge in a small group discussion format. Topics include: the cardiovascular, lymphatic, respiratory, urinary and reproductive systems.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 102 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring Summer"
    },
    "HSCI 125": {
        "shortName": "HSCI 125",
        "fullName": "Medical Terminology",
        "courseCredits": "3.0",
        "courseDesc": "This course is an introduction to the language of medicine intended as foundational for future study and professional practice. Students will study the basic vocabulary of medicine as well as the structure underlying that vocabulary in order to enhance future study and education.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring "
    },
    "HSCI 201": {
        "shortName": "HSCI 201",
        "fullName": "Health Assessment through the Lifespan",
        "courseCredits": "4.0",
        "courseDesc": "Course focuses on health assessment across the lifespan. The focus is on the development of interviewing skills, assessment of health status, and physical examination skills for the beginning health professional student.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 208 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "HSCI 202": {
        "shortName": "HSCI 202",
        "fullName": "Regional Anatomy",
        "courseCredits": "3.0",
        "courseDesc": "This course reviews human anatomy of the head, neck, thorax, abdomen, pelvis and extremities. Relationships of surface and internal structures from different bodily systems are emphasized. The analysis is supported by anatomical illustrations, radiological images, and cadaver photographs.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 205": {
        "shortName": "HSCI 205",
        "fullName": "Strategies for Academic Success",
        "courseCredits": "1.0",
        "courseDesc": "This course helps students to explore the learning process, to gain essential skills needed to achieve academic success and to develop the ability to make effective use of university resources. Discussion, personal reflection, and relevant electronic resources are used to foster students’ development as self-directed learners. Specific attention will be given to the following topics: study skills, learning strategies, time management, academic planning, test-taking techniques, and goal-setting. The goal of this course is to help improve students’ efficacy in the areas of academic self-management, self-direction, and resource utilization.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 206": {
        "shortName": "HSCI 206",
        "fullName": "Human Anatomy and Physiology for Health Sciences I",
        "courseCredits": "5.0",
        "courseDesc": "This course is a general study of the structures and physiology of the human body. Fundamental concepts of microscopic tissue structure, gross structures of organs and body system organization are taught. The course consists of both lecture and lab material. The lecture portion deals with the general principles and clinical relevance. In the lab, the student participates with practical examination of microscopic sections, tissues and organs, and the anatomical layout of human cadavers. The cell, tissues and musculoskeletal system will be covered in this course, as well as muscle and nerve physiology.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "HSCI 207": {
        "shortName": "HSCI 207",
        "fullName": "Human Anatomy and Physiology for Health Sciences II",
        "courseCredits": "5.0",
        "courseDesc": "This course is a continuation ofHSCI 206. This course is a general study of the structures and physiology of the human body. Fundamental concepts of microscopic tissue structure, gross structures of organs and body system organization are taught. The course consists of online lab and lecture material. The lecture deals with the general principles. In the lab, the student learns the practical application and understanding of microscopic sections, tissues and organs, and the anatomical layout of various organs. The nervous, endocrine and digestive system will be covered in this course.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 206 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "HSCI 208": {
        "shortName": "HSCI 208",
        "fullName": "Human Anatomy and Physiology for Health Sciences III",
        "courseCredits": "5.0",
        "courseDesc": "This course is the third of three lecture and laboratory courses that present a general study of human anatomy and physiology, including microscopic and gross anatomy observation. The course is designed as a foundational course for students pursuing a profession in the Health Sciences. In laboratory experiences, students examine anatomical models and specimens from human cadavers, conduct experiments, and apply knowledge learned in group discussions. Topics of the course include the cardiovascular, lymphatic, respiratory, urinary, electrolyte balance, and reproductive systems.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 206 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "HSCI 303": {
        "shortName": "HSCI 303",
        "fullName": "Pharmacology for Health Sciences",
        "courseCredits": "5.0",
        "courseDesc": "This course presents a general study of basic pharmacology in which principles underlying the actions of drugs are presented, including pharmacokinetics, drug-receptor interactions, and drug metabolism. Classes of drugs are presented as groups with “prototype” drugs in each group.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 208 [Min Grade D] or BIO 201 [Min Grade D] or HSCI 103 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "HSCI 310": {
        "shortName": "HSCI 310",
        "fullName": "Introduction to Research Methods",
        "courseCredits": "4.0",
        "courseDesc": "This course provides a comprehensive introduction to the principals and practices underlying health-related research. Topics to be covered include: the protection of human subjects; scientific misconduct; developing research questions; conducting literature searches; research designs; qualitative, quantitative, and mixed methods; critical appraisal of the health literature; and evidence-based practice.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "HSCI 313": {
        "shortName": "HSCI 313",
        "fullName": "Clinical Trials Protocols",
        "courseCredits": "4.0",
        "courseDesc": "Students learn to design and implement a clinical trial protocol. Topics include experimental design, research team member roles and management of clinical trials. Special research techniques for special populations are considered. Means of preventing scientific misconduct through proper monitoring are discussed.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 310 [Min Grade D] and COM 320 [Min Grade D] and (STS 350 [Min Grade D] or HSCI 350 [Min Grade D])",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 315": {
        "shortName": "HSCI 315",
        "fullName": "Current Issues in Health Sciences",
        "courseCredits": "4.0",
        "courseDesc": "This course is designed to discuss current issues and controversies in health science, with a focus on health-related issues attracting media attention. Topics may include: ethical dilemmas; how research informs healthcare policy; how research impacts healthcare practice; how interprofessional practice impacts patient safety and the patient experience in a culture of evidence-based practice; and cultural diversity, equity, and inclusion for underserved populations.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "COM 320 [Min Grade D] (Can be taken Concurrently) and HSCI 310 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring Summer"
    },
    "HSCI 320": {
        "shortName": "HSCI 320",
        "fullName": "Physiology",
        "courseCredits": "5.0",
        "courseDesc": "Presentation of organ function with emphasis on the integration of neural and humoral control mechanisms.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 207 [Min Grade D] and HSCI 208 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 325": {
        "shortName": "HSCI 325",
        "fullName": "Exercise Physiology",
        "courseCredits": "4.0",
        "courseDesc": "This course examines the acute and chronic effects of exercise on human physiology. Topical areas include neuromuscular physiology, cardiopulmonary, energy metabolism, nutrition, exercise evaluation, body composition, exercise prescription, and influence of environmental factors and clinical conditions on response to exercise.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 207 [Min Grade D] and (HSCI 208 [Min Grade D] or BIO 201 [Min Grade D] or HSCI 103 [Min Grade D])",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "HSCI 326": {
        "shortName": "HSCI 326",
        "fullName": "Applied Anatomy and Kinesiology",
        "courseCredits": "5.0",
        "courseDesc": "This course applies the foundations of anatomy and physiology to the study of human movement, with emphasis on normal motions of the musculoskeletal system. Topical areas include musculoskeletal anatomy, neuroanatomy, biomechanics, lever systems, and the influence of musculoskeletal disease and injury in normal movement.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 206 [Min Grade D] and (HSCI 207 [Min Grade D] or BIO 201 [Min Grade D])",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "HSCI 337": {
        "shortName": "HSCI 337",
        "fullName": "Genetics and Health",
        "courseCredits": "4.5",
        "courseDesc": "This course covers the fundamentals of human genetics from a healthcare perspective. The course presents concepts of classical genetics, outlines molecular mechanisms of heredity, and explores the evolving technological advances in DNA modifications and analysis. The course emphasizes the importance of the health professional in enhancing patient understanding of the impact of genetic technology in healthcare decisions. Additional topics include genetic counseling, assisted reproductive technologies and personal genomics.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "BIO 131 [Min Grade D] and BIO 134 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Summer"
    },
    "HSCI 345": {
        "shortName": "HSCI 345",
        "fullName": "Statistics for Health Sciences",
        "courseCredits": "4.5",
        "courseDesc": "This course is designed to provide students with a foundation of basic statistical knowledge to aid in reading and understanding research results in the health science literature. Topics will include: variable types, sampling, scales of measurement, reliability and validity of measurement, study designs, descriptive statistics, classical statistical inference, correlation, chi-square, parametric and nonparametric tests for group comparisons.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring "
    },
    "HSCI 350": {
        "shortName": "HSCI 350",
        "fullName": "Advanced Statistics for the Health Sciences",
        "courseCredits": "4.0",
        "courseDesc": "This course is designed to provide students with an understanding of advanced statistical procedures and their applications to research designs in the health science literature. Topics include: one-way, two-way, repeated measure, and mixed factorial analyses of variance (ANOVAs); analysis of covariance (ANCOVA); multivariate analysis of variance (MANOVA); correlation; bivariate, multivariate, and logistic regressions; odds/risk ratios; exploratory factor analysis; and meta-analytic techniques.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "STS 345 [Min Grade D] or HSCI 345 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 375": {
        "shortName": "HSCI 375",
        "fullName": "Fundamentals of Toxicology",
        "courseCredits": "4.0",
        "courseDesc": "Toxicology is an applied science that studies the adverse effects of toxins on the human body. This course is an upper level elective that introduces students to the basic principles of toxicology. The concepts covered in the course include toxicokinetics (toxin absorption, distribution, metabolism and excretion), toxicodynamics (toxin site and mechanism of action), carcinogenesis, and environmental toxicology.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 207 [Min Grade D] and (HSCI 208 [Min Grade D] or BIO 201 [Min Grade D])",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 380": {
        "shortName": "HSCI 380",
        "fullName": "Strength and Conditioning",
        "courseCredits": "4.0",
        "courseDesc": "This course addresses the selection and implementation of strength, power, speed, agility, endurance, and hypertrophy training methods with an emphasis on periodization programs. Components of the course include discussion of physiological principles and strength assessment as they relate to resistance exercise training.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated 3 times for 16 credits",
        "prereqs": "HSCI 208 [Min Grade D] or BIO 201 [Min Grade D] or HSCI 103 [Min Grade D]",
        "coreqs": "HSCI 325",
        "restrictions": null,
        "offered": ""
    },
    "HSCI 381": {
        "shortName": "HSCI 381",
        "fullName": "Exercise for Clinical Populations",
        "courseCredits": "4.0",
        "courseDesc": "This course builds upon the foundational principles of exercise testing and prescription in clinical populations living with various forms of cardiovascular, metabolic, and inflammatory chronic diseases and health conditions. The impacts of exercise on each condition are examined, along with the special considerations required when prescribing exercise for people in the discussed conditions.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 325 [Min Grade D]",
        "coreqs": "HSCI 425",
        "restrictions": null,
        "offered": "Summer"
    },
    "HSCI 382": {
        "shortName": "HSCI 382",
        "fullName": "Pathophysiology for Health Professions",
        "courseCredits": "5.0",
        "courseDesc": "Building on a foundation of normal physiology, students are exposed to the major disturbances of normal function and the basic mechanisms involved in diseases of the major organ systems. The course includes discussion of the general aspects of the common human pathophysiological conditions and syndromes.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 103 [Min Grade D] or BIO 201 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "HSCI 410": {
        "shortName": "HSCI 410",
        "fullName": "Psychology of Physical Activity",
        "courseCredits": "4.0",
        "courseDesc": "The course is designed to introduce students to the psychology of physical activity by providing a broad overview of theoretical foundations, current research applications, and implications for health and exercise practitioners.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PSY 101 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 415": {
        "shortName": "HSCI 415",
        "fullName": "Musculoskeletal Pathophysiology",
        "courseCredits": "4.0",
        "courseDesc": "Introduction to the study of diseases, disorders and injuries of the musculoskeletal system. The biomechanics of connective tissue and basic science of inflammation, repair, regeneration and fibrosis are discussed. Students learn the pathogenesis, pathophysiology and clinical presentation of selected musculoskeletal disorders. The concepts of epidemiology and risk factors are considered.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 208 [Min Grade D] or BIO 201 [Min Grade D] or HSCI 103 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "HSCI 420": {
        "shortName": "HSCI 420",
        "fullName": "Advanced Anatomy",
        "courseCredits": "5.0",
        "courseDesc": "This course introduces the fundamentals of Gross Anatomy. Students will expand upon their introductory Anatomy and Physiology education by studying the human body through a regional, rather than systems approach. Topics will include the head and neck, upper and lower extremities, thorax, abdomen and pelvis.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 208 [Min Grade D] or BIO 201 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Spring "
    },
    "HSCI 425": {
        "shortName": "HSCI 425",
        "fullName": "Exercise Testing and Prescription",
        "courseCredits": "4.0",
        "courseDesc": "This course covers the fundamental principles of exercise testing and prescription with an emphasis on the health-related components of physical fitness that include body composition, cardiorespiratory fitness, muscular strength, muscular endurance, and flexibility. Students use these principles to develop appropriate exercise prescriptions for healthy and selected clinical populations. Laboratory experiences provide students with opportunities to engage in exercise testing and apply exercise prescription principles in health, fitness, and sport.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 325 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "HSCI 430": {
        "shortName": "HSCI 430",
        "fullName": "Developmental Anatomy",
        "courseCredits": "4.0",
        "courseDesc": "This course expands upon the student's knowledge of anatomy by describing the events involved in the formation of organ systems in the developing human. The laboratory portion of the course examines congenital defects of the systems and discusses possible causes and treatments form a clinical perspective.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 207 [Min Grade D] and (HSCI 208 [Min Grade D] or BIO 201 [Min Grade D])",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 435": {
        "shortName": "HSCI 435",
        "fullName": "Neuroscience",
        "courseCredits": "5.0",
        "courseDesc": "This course builds on students’ basic knowledge of anatomy and physiology and provides a strong foundation in the structure and function of the nervous system. Clinical correlations are used throughout the course to help students understand the neuroanatomical and neurophysiological basis for the presentation of selected neurological pathologies commonly seen in clinical practice.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "HSCI 207 [Min Grade D] or BIO 201 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "HSCI 440": {
        "shortName": "HSCI 440",
        "fullName": "Emerging Technologies in Healthcare",
        "courseCredits": "3.0",
        "courseDesc": "This course explores recent developments in the emerging fields of regenerative medicine, genomics and nanomedicine. Through lectures and assigned readings students will be introduced to fundamental concepts of stem cell biology, tissue engineering, genomic testing, and nanobiotechnology. Emphasis will be placed on clinical applications of these technologies, as well as their impact on the changing role of healthcare providers.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "HSCI 450": {
        "shortName": "HSCI 450",
        "fullName": "Undergraduate Research Experience",
        "courseCredits": "4.0",
        "courseDesc": "This course is designed to provide students matriculated in the undergraduate health and exercise science majors with a cumulative undergraduate research experience. Students leverage knowledge gained in prerequisite coursework, employ skills gained from laboratory-based courses and integrate their abilities to successfully design, implement and disseminate a scholarship research project.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "COM 320 [Min Grade D] and HSCI 310 [Min Grade D] and HSCI 345 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "HSCI 470": {
        "shortName": "HSCI 470",
        "fullName": "Readings in Health Sciences",
        "courseCredits": "1.0-6.0",
        "courseDesc": "This course is designed to allow upper-class student to pursue specialized interests in specific topics in the health sciences. May be repeated twice for credit.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated 2 times for 12 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI 490": {
        "shortName": "HSCI 490",
        "fullName": "Senior Research Project",
        "courseCredits": "3.0",
        "courseDesc": "In this course, the student, with faculty supervision, selects a topic for a term project that integrates the academic and practical knowledge the student has acquired in his/her curriculum. The student develops objectives relevant to the project, critiques the literature, presents a plan for implementation, and completes the term project.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI I299": {
        "shortName": "HSCI I299",
        "fullName": "Independent Study in Health Sciences",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed course within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI I399": {
        "shortName": "HSCI I399",
        "fullName": "Independent Study in Health Sciences",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed course within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI I499": {
        "shortName": "HSCI I499",
        "fullName": "Independent Study in Health Sciences",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed course within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI T180": {
        "shortName": "HSCI T180",
        "fullName": "Special Topics in Health Sciences",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "HSCI T280": {
        "shortName": "HSCI T280",
        "fullName": "Special Topics in Health Sciences",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI T380": {
        "shortName": "HSCI T380",
        "fullName": "Special Topics in Health Sciences",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "HSCI T480": {
        "shortName": "HSCI T480",
        "fullName": "Special Topics in Health Sciences",
        "courseCredits": "1.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Nursing & Health Professions",
        "repeatStatus": "Can be repeated 4 times for 24 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    }
}