{
    "JWST 101": {
        "shortName": "JWST 101",
        "fullName": "Introduction to Jewish Studies",
        "courseCredits": "3.0",
        "courseDesc": "What is a Jew? Who is a Jew? What defines Judaism? These questions relate to religion, ethnicity, culture, nation, race, and more. A shared heritage unites Jews, yet understandings and interpretations of what it means to be Jewish are hotly contested, especially in the 21st century. In this course, we dig into Jewish thought and history and explore the ways they have shaped ethnic identity, cultural heritage, and religious tradition.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 117": {
        "shortName": "JWST 117",
        "fullName": "Introduction to World Religions",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces students to the world religions from an anthropological perspective. Hence the basic concerns of an anthropological approach - worldview, ritual, myth, and so forth - are introduced early and applied to each of the religions studied.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 201": {
        "shortName": "JWST 201",
        "fullName": "Jewish Literature and Civilization",
        "courseCredits": "3.0",
        "courseDesc": "This course surveys the origins and foundations of Judaism: the core texts and narratives; and the enduring practices, beliefs, and traditions. We will explore biblical and historical accounts of the early history of the Jewish people and assess their influence in shaping Jewish practice, identity, and religious expression. We will also examine Jewish observance and the ways in which the bible and ancient Jewish history left their mark on modern Jewish life.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 202": {
        "shortName": "JWST 202",
        "fullName": "Jewish Life and Culture in the Middle Ages",
        "courseCredits": "4.0",
        "courseDesc": "This course surveys the history of the Jewish people from the rabbinic period until the early modern period. Jewish civilization and religion primarily outside of the Land of Israel will be explored. Topics include the encounter with Christianity and Islam; the emergence of the Talmud, Jewish mysticism, and other exegetical tracts; and the development of diverse Jewish communities.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 203": {
        "shortName": "JWST 203",
        "fullName": "Modern Jewish History",
        "courseCredits": "4.0",
        "courseDesc": "This is an introductory course that explores the social, cultural, political and religious forces that have shaped Jewry the world over from the 18th to the 21st centuries. Students learn about the move of a traditional society into the modern world. At the same time, the course stresses the strategies that a minority group evolves in order to maintain its identity. Topics will include Hasidism, Emancipation and Enlightenment, modern religious movements, socialism, modern Hebrew and Yiddish literature and culture, immigration to America. the Holocaust, Zionism and the State of Israel, and post-World War II Jewry the world over.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 211": {
        "shortName": "JWST 211",
        "fullName": "American Jewish Experience",
        "courseCredits": "4.0",
        "courseDesc": "This course surveys the Jewish experience in America from the colonial period to the present. We will discuss the various waves of Jewish immigration and examine the religious, cultural, political, and economic activities of American Jews. We will consider the trajectories that shaped the experiences of Jews in America and the heterogeneity of Jewish experience and views. A diverse array of sources and topics will provide the framework for this course. The case study of the Jews in the United States elucidates major nations historical issues including immigration, acculturation, minority rights, prejudice and discrimination, intergroup relations, ethnic and racial pride and intermarriage. We will consider how Jews resolved the tensions between being Jewish and American.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 212": {
        "shortName": "JWST 212",
        "fullName": "Contemporary Jewish Life",
        "courseCredits": "3.0",
        "courseDesc": "The course will focus on the social and religious activities of Jews since the 1970s via four community studies. We will attempt to understand the meaning that Jewish people derive from their beliefs, rituals and institutions. The stress will be on Jewish life in the United States, but one study will concentrate on the state of Israel. The goal will be to better understand the dynamics of personal and group identity development during the life cycle and contemporary history since the Holocaust.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 213": {
        "shortName": "JWST 213",
        "fullName": "Jewish Cultural Tapestry",
        "courseCredits": "3.0",
        "courseDesc": "We will examine the different customs and traditions that Jews developed in various parts of the globe throughout history. We will learn about both the rich cultural diversity that developed during the history of local communities and the religious traditions and principles of community organization that have been shared by Jews. The Jews will be treated as a case study to understand the mechanisms by which ethnic and religious groups develop and maintain their group identity despite the fact that they have been dispersed and have experienced minority status. We will argue that the shared religious culture and the paralleled local specificity of culture together have guaranteed the continued existence of this people, the Jews.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 215": {
        "shortName": "JWST 215",
        "fullName": "Reconstructing History After Genocide",
        "courseCredits": "3.0",
        "courseDesc": "The course explores educational restitution to peoples who are victims of genocide. After conceptualizing the world’s responsibility to maintain its cultures and help victims of genocide to recover their history, the class will compare educational efforts to document life before the destruction in places such as Rwanda, the former Yugoslavia and among Native Americans. Our main focus will be the politics of teaching about Polish Jewry, the largest community of Jews before WW II that was destroyed by the Nazis in the Holocaust. Students will evaluate sources that describe Jewish life in one city, Lublin, Poland.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 216": {
        "shortName": "JWST 216",
        "fullName": "Yiddish Literature & Culture",
        "courseCredits": "3.0",
        "courseDesc": "The course describes the major Jewish culture during the past thousand years. In a lively course stressing the arts and everyday family life, students will be introduced to the multi-faceted Yiddish language and culture. Through study and meetings with community members, students learn how Yiddish both reflects and gives meaning to life. Texts will include English translations of proverbs, folktales, folksongs, prayers, epics, personal diaries, memoirs, drama, films, memorial literature, modern fiction and poetry.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 221": {
        "shortName": "JWST 221",
        "fullName": "Anthropology of Interfaith Relations",
        "courseCredits": "3.0",
        "courseDesc": "This course is meant to be an elective for Jewish Studies, Religious Studies, and for the Certificate in Interfaith and Religious Studies. It aims to introduce students to how anthropological and ethnographic analyses can help us understand the variety of ways in which people of different faiths both conflict with and work amicably together.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 222": {
        "shortName": "JWST 222",
        "fullName": "Comparative Religious Ethics",
        "courseCredits": "3.0",
        "courseDesc": "The eternal teaching of the different religions and how they address such issues as war, sexuality and economics. This online course initiates a sequence of interfaith courses. In that capacity, it aims to introduce students to the religious traditions of Buddhism, Hinduism, Judaism, Christianity, and Islam and to the ways their ethics converge in a deeper understanding of humanity. The goal, however, is that students do not just understand but also feel the emotional connection between ethical principles and the different religious visions behind them. Ultimately, the objective is to foster greater appreciation for the diverse religious orientations toward moral purpose and the ultimate meaning of life.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 223": {
        "shortName": "JWST 223",
        "fullName": "Coexistence and Conflict: Jews, Christians, and Muslims in the Early Mediterranean",
        "courseCredits": "4.0",
        "courseDesc": "This course investigates the history of interactions among the early Mediterranean's three major monotheistic religious communities: Jews, Christians, and Muslims. The course explores how religious communities understood themselves and each other as well as how and why multi-faith communities sometimes coexisted peacefully, sometimes coexisted tensely, and sometimes exploded into violence.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 224": {
        "shortName": "JWST 224",
        "fullName": "Judaism and Christianity: Two Religions or One?",
        "courseCredits": "3.0",
        "courseDesc": "The relation between Christianity and Judaism is one of the most misunderstood in the history of thought. Christianity is often considered to be diametrically opposed to Judaism, to be a rejection of the Judaic worldview. Indeed, prominent thinkers in the history of Christianity, such as Martin Luther, have reinforced this position. Yet Christianity was originally a development within Judaism, a sect, so to speak, of Judaism. The earliest Christians were Jewish followers of a Jewish leader and conceived of themselves as faithful Jews. So how did the two religions come to be viewed as opposed? Do elements of Judaism remain as part of the foundation of the new faith of Christianity? Where do the two faiths converge and where do they diverge? This course endeavors to answer these important questions.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 225": {
        "shortName": "JWST 225",
        "fullName": "Philosophy of Religion",
        "courseCredits": "3.0",
        "courseDesc": "Studies various aspects of religious belief and experience from a philosophical standpoint, considering issues such as the definition and existence of God, the nature and course of evil, and the relationship between faith and reason in a religious life.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 226": {
        "shortName": "JWST 226",
        "fullName": "History of the Holocaust",
        "courseCredits": "4.0",
        "courseDesc": "This course surveys Nazi Germany's systematic attempt to exterminate the Jews of Europe between 1941 and 1945. The course stresses the historical study of the Holocaust: the course of events, their origin and context, and their repercussions. We study the general context of the 1930's and 1940's, the perpetrators and their relevant ideology and administrative systems, the victims and intended victims, and also the \"bystanders\", those among whom the round-ups and extermination took place in Europe as well as in the US. The materials include historical documents, memoirs, and historical accounts, and a variety of films.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 227": {
        "shortName": "JWST 227",
        "fullName": "History of Antisemitism",
        "courseCredits": "4.0",
        "courseDesc": "For centuries, Jews have suffered prejudice, discrimination, and persecution. Jewish people have been vilified for denying the divinity of Jesus Christ; they were unjustly marked as murderers, usurers, and villains of all sorts; they were condemned for their supposed role in defiling and undermining the “white-race”; they were accused of committing the greatest abuses of capitalism, and at the same time, were charged with inventing socialism and Communism. What is antisemitism? How did it start? Why is it so enduring? This course will explore the long history of a perplexing and irrational phenomenon. This course will examine the racial, political, and economic forms of antisemitism in the ancient, medieval, and modern world.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 228": {
        "shortName": "JWST 228",
        "fullName": "Antisemitism in America",
        "courseCredits": "4.0",
        "courseDesc": "The past few years have shown that antisemitism is alive and well in the United States, in spite of a decades-long lull. While the Pittsburgh, San Diego, and Newark shootings, and the Hanukkah attack in Monsey show are the most violent expressions of antisemitism that this country has ever seen, these are not the only times during which Jews were identified as outsiders and a threatening presence. This course will examine Jewish exclusion through the mid-20th century including General Grant’s expulsion of Jews, the Leo Frank lynching and Henry Ford’s Dearborn Independent, Father Coughlin’s antisemitic radio addresses, the Nazi rally and Madison Square Garden. Finally, it will explore the recent rise in antisemitism and relationship between white supremacy and antisemitism.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 229": {
        "shortName": "JWST 229",
        "fullName": "Pirates, Planters, Traders: The Jewish Atlantic World",
        "courseCredits": "4.0",
        "courseDesc": "When European empires expanded to the New World, their ships carried Jews to North America, Latin America, and the Caribbean. Jews were relegated to a marginalized group in Europe, but the New World opened up opportunities. They owned plantations and participated in extensive trading enterprises in the New World, including sugar cultivation, the triangulated slave trade, trade in precious gems, and the fur-trade. This course will investigate the ways in which Jews participated in colonial environments in the 16th-18th centuries: their business pursuits and their interactions with Europeans, Africans, and Native Americans. It will also explore Jews' improved status in diverse New World environments, and the ways Jews created hybrid communities in environments formerly devoid of Jewish life.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 230": {
        "shortName": "JWST 230",
        "fullName": "Jewish Humor in Literature and Film",
        "courseCredits": "3.0",
        "courseDesc": "This course explores the unique role of Jewish humor in literature and film in the 20th and 21st centuries in relationship to aspects of Jewish life ranging from assimilation to antisemitism, through a selection of novels, short stories, essays, plays, and film. Some of the authors whose works we may discuss and analyze include Philip Roth, Neil Simon, and Melissa Broder in addition to filmmakers such as Mel Brooks, Woody Allen, the Coen Brothers, and Sasha Baron Cohen.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null
    },
    "JWST 298": {
        "shortName": "JWST 298",
        "fullName": "Field Work in Jewish Studies",
        "courseCredits": "3.0",
        "courseDesc": "In this course, students will do independent fieldwork within a Jewish communal organization in the USA or abroad, or ethnographic or archeological fieldwork. The plan of the work, weekly time commitment, and periodic reports will be agreed upon in advance by the student and the faculty member. This is a three-credit elective course for the Louis Stein Jewish Studies Minor. It may also be used as a free elective course for a variety of students.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 2 times for 9 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 307": {
        "shortName": "JWST 307",
        "fullName": "Literature of Genocide",
        "courseCredits": "3.0",
        "courseDesc": "Genocide is defined as “acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group” (U. N. Office on Genocide Prevention). This course will feature literature, film, and articles, by survivors themselves, historians and other writers, about major genocides and their perpetrators. Topics may include cases from any part of the world or century up to the present.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 330": {
        "shortName": "JWST 330",
        "fullName": "The Bible as Literature",
        "courseCredits": "3.0",
        "courseDesc": "This course provides a close reading of selected books of the Old and New Testaments alongside selected literary works to discover both the literary qualities of these texts and their influence on literature.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null
    },
    "JWST 350": {
        "shortName": "JWST 350",
        "fullName": "Jewish Health and Medical Ethics",
        "courseCredits": "3.0",
        "courseDesc": "This course offers resources for and approaches to Jewish biomedical and health ethics. We will examine Jewish positions on such topics as abortion, medical decisions at the end of life, advance directives, transplantation, reproductive technologies, and allocation of health care resources, considering the role of Jewish texts, values, and ethics in addressing contemporary health and medicine. We will consider what role the history of antisemitism plays in modern considerations around Jewish bodies, paying particular attention to Nazi medical experimentation and the use of those studies in contemporary times. We will look at the long history of antisemitism in the depiction of Jewish bodies and Jewish practice, considering what role these depictions have played in medical considerations.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST 377": {
        "shortName": "JWST 377",
        "fullName": "Jewish Mysticism and Kabbalah",
        "courseCredits": "3.0",
        "courseDesc": "In this course students will examine the origins and development of Kabbalah, and will explore a wide range of subjects from the perspective of various Kabbalistic sources. Topics to be covered include: the origins of existence, the soul and its purpose, life and death, reincarnation, angels and demons, meditation, freedom of choice, human strengths and weaknesses. We will also examine song and music in the mystical tradition, and how these ideas may help improve personal characteristic traits. Attention will be paid to understanding the makeup of the human psyche and how Kabbalah sees the role of man in the larger universe.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST I399": {
        "shortName": "JWST I399",
        "fullName": "Independent Study in Jewish Studies",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST T180": {
        "shortName": "JWST T180",
        "fullName": "Special Topics in Jewish Studies",
        "courseCredits": "1.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study. The difficulty of the course will be appropriate for a 100-level course.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST T280": {
        "shortName": "JWST T280",
        "fullName": "Special Topics in Jewish Studies",
        "courseCredits": "1.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study. The difficulty of the course will be appropriate for a 200-level course.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "JWST T380": {
        "shortName": "JWST T380",
        "fullName": "Special Topics in Jewish Studies",
        "courseCredits": "1.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study. The difficulty of the course will be appropriate for a 300-level course.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    }
}