{
    "PBHL 101": {
        "shortName": "PBHL 101",
        "fullName": "Public Health 101",
        "courseCredits": "3.0",
        "courseDesc": "Introduction to Public Health is a broad overview class designed to give an introduction to the core tenets of Public Health. Basic concepts covered in the class are the basic definitions and concepts related to public health. Specific areas that will be further explored in the class include, what it means to be healthy, what is public health, what are social determinants of health, what is disease prevention and health promotion and what are health inequalities among others.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 210": {
        "shortName": "PBHL 210",
        "fullName": "Biostatistics I",
        "courseCredits": "4.0",
        "courseDesc": "Biostatistics gives us the tools to turn data into scientific knowledge that can improve human health. In this course, students will gain skills in foundational biostatistical methods including probability, hypothesis testing and parameter estimation, analysis of categorical data, parametric and non-parametric tests for means and proportions, and analysis of variance (ANOVA), emphasizing appropriate application of methods based on study design and data characteristics. Students will use the open-source statistical software R.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 211": {
        "shortName": "PBHL 211",
        "fullName": "Biostatistics II",
        "courseCredits": "3.0",
        "courseDesc": "Biostatistics gives us the tools to turn data into scientific knowledge that can improve human health. In this course, students will expand their skills in foundational biostatistical methods, including simple and multiple linear regression, analysis of confounding and interaction, logistic regression, and descriptive analysis for survival data. Students will use the open-source statistical software R.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 210 [Min Grade C] or STAT 201 [Min Grade C] or MATH 310 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 215": {
        "shortName": "PBHL 215",
        "fullName": "Introduction to Clinical Research",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces the methodologic principles of clinical research which are foundational to assessing the safety and efficacy of clinical interventions and to making evidence-based clinical decisions. The course will start with framing a clinical research question, followed by presenting the methods of clinical research, common sources of error, and an epidemiologic approach to critical appraisal. Topics include searching the literature, study design, reliability and validity of clinical tools, questionnaire design, interpreting results of clinical studies, and identifying and controlling for confounding and bias in research studies. The course includes a special focus on the ethical, operational, and methodological aspects of clinical trials, which are critical to the practice of medicine.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 210 [Min Grade C] or STAT 201 [Min Grade C] or MATH 310 [Min Grade C] or PBHL 301 [Min Grade C] or HSCI 345 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 301": {
        "shortName": "PBHL 301",
        "fullName": "Epidemiology in Public Health",
        "courseCredits": "3.0",
        "courseDesc": "This is an introductory course designed to teach undergraduate students the basic principles and concepts of epidemiology. The course highlights the approaches used in the field of epidemiology to study disease in populations, incorporating concepts of disease causation and control.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 302": {
        "shortName": "PBHL 302",
        "fullName": "Introduction to the History of Public Health",
        "courseCredits": "3.0",
        "courseDesc": "This course considers the origins of contemporary public health by examining major currents in the history of public health in the United States from Colonial times to the present, with an emphasis on the 20th century.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 303": {
        "shortName": "PBHL 303",
        "fullName": "Overview of Issues in Global Health",
        "courseCredits": "3.0",
        "courseDesc": "This introductory course will cover the major issues and considerations involved in global health. It is a survey course that is designed to familiarize students with the major topics in the global health. The goal of the course is to provide students with an overview of concepts such as the determinants of health, the measurements of health status and global burden of the disease.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 304": {
        "shortName": "PBHL 304",
        "fullName": "Introduction to Health & Human Rights",
        "courseCredits": "3.0",
        "courseDesc": "This introductory course highlights the intrinsic link between one's health and his/her fundamental human rights. When such rights (access to medical care, housing, food, standard of living) are violated, this can lead to adverse health outcomes.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 305": {
        "shortName": "PBHL 305",
        "fullName": "Women and Children: Health & Society",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to give students a broad overview of pertinent issues surrounding the health and well being of mothers and children. The course emphasizes the inter-relationship among women's health, reproductive health and child health.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 306": {
        "shortName": "PBHL 306",
        "fullName": "Introduction to Community Health",
        "courseCredits": "3.0",
        "courseDesc": "This three credit course will provide the foundation for studying the root causes affecting community health in the United States, as well as broad efforts to improve world health. This course is designed to enhance oral and written communications on public health issues, advocacy, and public policy, while enhancing content, process skills, and other essential competencies.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 307": {
        "shortName": "PBHL 307",
        "fullName": "Injury Prevention and Control",
        "courseCredits": "3.0",
        "courseDesc": "Unintentional injury is the leading cause of death for people in the United States between the ages of 1 and 44. Homicide and suicide are the second and third leading cause of death for people aged 15-34. The cost of medically treated injuries is estimated at over $100 billion annually. This course examines injury as one of the core public health problems in the United States. Causes such as motor vehicles, opioids, interpersonal and self-inflicted violence, and work are some of the topics examined, including their physical and psychological outcomes. The subsequent costs and burdens to the healthcare system are explored. Policy and behavioral interventions are addressed. Where possible, extensions to international settings are made.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 308": {
        "shortName": "PBHL 308",
        "fullName": "The U.S. Public Health System",
        "courseCredits": "3.0",
        "courseDesc": "This course will provide students with an understanding of the organizational components of the public health system in the United States. Among the topics covered are the roles of different levels of government in the financing, delivery, and regulation of public health services and the complementary private, non-profit components of the public health system. The course addresses several current, critical public health policy issues and how different political and economic interests and actors interact in shaping public policy on these issues.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 309": {
        "shortName": "PBHL 309",
        "fullName": "Public Health Ethics",
        "courseCredits": "3.0",
        "courseDesc": "This course will explore the emergence of the public health field, its philosophical, historical, and political development, its relationship to the field of human rights and its future. Emphasis will be placed on developing a mastery of the current literature on the subject and on formulating novel approaches in public health ethics. This course is demanding in both reading and writing; students should be prepared to engage in serious dialogue each week in class.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 310": {
        "shortName": "PBHL 310",
        "fullName": "Burden of Disease",
        "courseCredits": "3.0",
        "courseDesc": "This course will cover selected topics of the burden of disease with critical review of the current public health literature. Students will have the opportunity to learn the basic concepts and methods of exploring risk factors and assessing the burden of disease at regional, national and global levels, through class lectures, group exercise and individual projects.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 301 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 311": {
        "shortName": "PBHL 311",
        "fullName": "Public Health Biology",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to introduce students to the biologic basics of the causes, natural history, and prevention of diseases of public health importance. An integrated perspective will be used to demonstrate the connection between exposures and cellular effects, disease processes in individuals, and population impacts. Coverage will include infectious disease transmission and prevention; cancer biology regarding etiology, prevention, and treatment; nutritional influences in obesity, diabetes and heart disease.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(BIO 107 [Min Grade C] or BIO 122 [Min Grade C] or BIO 131 [Min Grade C]) and PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 313": {
        "shortName": "PBHL 313",
        "fullName": "The Social Determinants of Health and Well-Being",
        "courseCredits": "3.0",
        "courseDesc": "The goal of this course is to introduce students to the patterning of health and well-being among social groups within and between societies, and how a social science approach can improve our understanding of health and illness at a population level, and identify possible public health strategies for reducing health disparities.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 314": {
        "shortName": "PBHL 314",
        "fullName": "Environmental and Occupational Health",
        "courseCredits": "3.0",
        "courseDesc": "The goal of this course is to provide students with basic knowledge of EOH as it applies to the practice of public health from individual, community and political perspectives. Students will also gain skills needed to understand and conduct scientific research related to EOH. Students will be expected to critically analyze EOH issues and explore appropriate responses.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 315": {
        "shortName": "PBHL 315",
        "fullName": "Public Health Leadership",
        "courseCredits": "3.0",
        "courseDesc": "This course provides students with an introduction to the environment and organizations in public health leadership. This course introduces leadership skills to lead changes in public health organizations. The cases and lectures throughout the course have been designed to develop leadership approaches for public health agencies.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 316": {
        "shortName": "PBHL 316",
        "fullName": "Drugs, Society, and Public Health",
        "courseCredits": "3.0",
        "courseDesc": "This course will examine problems associated with drug use through the prism of public health. The first half of the course will be devoted to understanding biological, psychological, social, and cultural aspects of key licit and illicit substances. The second half will focus on relevant public health aspects of drug use, including preventions, intervention, treatment, and policy. Intersecting issues include homelessness, HIV/AIDS, mental health & violence. Students will be exposed to key books and peer-reviewed articles that address these issues from a range of theoretical & analytical approaches.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 317": {
        "shortName": "PBHL 317",
        "fullName": "The World's Water",
        "courseCredits": "3.0",
        "courseDesc": "Water is essential for life. Worldwide, 25% of people lack safely managed drinking water services and nearly 50% lack safely managed sanitation services. Safe and sufficient water, sanitation and hygiene services (WASH) are key for health and human rights. WASH services are a critical component of responses to infectious disease epidemics and ensuring infection prevention in healthcare facilities. Contaminated drinking water, inadequate water supply, or poor sanitation and hygiene all contribute to disease burden and decreased quality of life, particularly among the most vulnerable populations. This course will discuss a wide variety of topics related to WASH around the globe and the U.S. and will explore how WASH problems are compounded by emerging infectious diseases, climate change and rapid urbanization.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 318": {
        "shortName": "PBHL 318",
        "fullName": "Violence and Trauma in Public Health",
        "courseCredits": "3.0",
        "courseDesc": "This course will focus on the public health policy and practice aspects of trauma violence and adversity. The course will begin by laying a foundation of trauma theory and then will examine the impact of emerging knowledge on individuals, communities and systems. The course will examine trauma informed models, which have been applied to individuals, communities and systems and will analyze the policy and practice implications of these models as well as the translation from research to practice.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 319": {
        "shortName": "PBHL 319",
        "fullName": "Nature Prescription: Trees, Green Space, and Your Health",
        "courseCredits": "3.0",
        "courseDesc": "Trees and green spaces distinctly shape the character of cities, and there is increasing evidence that vegetated landscapes also affect the health of urban residents. We will explore the relationship between vegetated landscapes and human health outcomes - from improved mental health and outdoor recreation, to benefits from ‘ecosystem services’ provided by trees and other vegetation. The environmental and biological mechanistic pathways leading to health effects will be delineated. Risk-benefit tradeoffs will also be considered. Also discussed will be the types of health impact data that may be useful to planners and policy makers to support decisions for installation of new parks or other urban vegetation, and a field assessment to estimate such impacts will be conducted.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 321": {
        "shortName": "PBHL 321",
        "fullName": "Disease Outbreak Investigations",
        "courseCredits": "3.0",
        "courseDesc": "The emergence of new pathogens and drug resistance, as well as increased transmission opportunities caused by globalization has led to a rising prevalence of new infectious diseases as well as reemergence of older diseases. this course will focus on the surveillance, identification, control, and prevention of selected infectious diseases of Public Health importance both globally and within the U.S. Specific areas that will be addressed include the causative agents, the routes of transmission, the host responses, environmental factors, unique risk factors, outbreak investigations, surveillance and strategies for control and prevention. We will incorporate the history of communicable disease control efforts where relevant and discuss the role of increased globalization in the spread of infectious diseases.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 333": {
        "shortName": "PBHL 333",
        "fullName": "Health Inequality",
        "courseCredits": "3.0",
        "courseDesc": "This course addresses questions related to health inequities—the systematic and avoidable differences in the health of social groups (e.g., racial, ethnic, gender, socioeconomic, sexual orientation) in a society. This multidisciplinary course integrates knowledge from the fields of public health, biology, medicine, sociology, psychology, political science, and history to provide students with a cohesive understanding of the magnitude of health disparities in societies, the processes through which they are produced, and methods for analyzing disparities.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 101 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 335": {
        "shortName": "PBHL 335",
        "fullName": "Applied Quantitative Research Methods",
        "courseCredits": "3.0",
        "courseDesc": "How can we tell if the water we drink is making us sick? What’s the best way to estimate the prevalence of a new infectious disease? How do we know when an intervention is effective in reducing mortality? New and challenging data analysis problems require skills in quantitative research and computing. This course uses data from fields including environmental health and infectious disease to build research skills in exploratory data analysis, data visualization, statistical modeling and analysis, and scientific communication. The statistical software R is used. Students will develop skills in data visualization, multivariable regression modeling, generalized linear models, model diagnostics, and critical interpretation of results. Students will use these skills in a final data analysis project and report.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 210 [Min Grade C] or STAT 201 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 340": {
        "shortName": "PBHL 340",
        "fullName": "Advanced Biostatistical Analysis",
        "courseCredits": "3.0",
        "courseDesc": "This course will build skills in data analysis using the statistical software R. Topics include data visualization, writing functions in R, and the application of statistical methods including multiple regression, generalized linear models, non-parametric regression, and basic survival analysis.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 211 [Min Grade C] or STAT 202 [Min Grade C] or MATH 411 [Min Grade C] or HSCI 350 [Min Grade C] or INFO 332 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 350": {
        "shortName": "PBHL 350",
        "fullName": "Introduction to Urban Health",
        "courseCredits": "3.0",
        "courseDesc": "It is estimated that by 2050, 66% of the world’s population will live in urban areas. Promoting population health and health equity is a key challenge, but also a key opportunity for cities and broader urban areas that surround them. This course is designed to provide an overview of urban health including theory, methodology, and empirical evidence. The course will explore urban health strategies, including programs and policies aimed at impacting the social determinants of health, and how these strategies affect health outcomes of populations in urban settings.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 362": {
        "shortName": "PBHL 362",
        "fullName": "Global Air Pollution and Health",
        "courseCredits": "3.0",
        "courseDesc": "Global air pollution is an important determinant of human health, causing millions of deaths worldwide each year. This course will examine how air pollutants are emitted into or form in the atmosphere, how people are exposed to air pollutants, and how these pollutants contribute to the burden of death, disease and disability in human populations. The course will provide an understanding of the properties of air pollutants, relevant atmospheric chemistry and physical processes, and how pollutants are measured. Students will consider inequities in the impact of air pollutants on human populations across the globe. Students will learn about national programs and policies for the control of air pollutants, and about the international agencies working to solve air pollution as a global health problem.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 400": {
        "shortName": "PBHL 400",
        "fullName": "Introduction to Statistical Inference",
        "courseCredits": "4.0",
        "courseDesc": "This course will introduce the theoretical framework of commonly used statistical methods, making connections between probability theory and providing context to understand when statistical methods can be used appropriately. Topics include exponential family probability distributions, conditional distributions and independence, expectations and transformations, point and interval estimation, maximum likelihood estimation, hypothesis testing and likelihood ratio tests.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "MATH 122 [Min Grade C] and (PBHL 210 [Min Grade C] or STAT 201 [Min Grade C] or MATH 310 [Min Grade C])",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 401": {
        "shortName": "PBHL 401",
        "fullName": "Introduction to Public Health",
        "courseCredits": "0.0",
        "courseDesc": "The purpose of this course is to provide a broad introduction to public health, as well as an understanding about how specialized health research contribute to achieving the goals of public health.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated 2 times for 0 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 411": {
        "shortName": "PBHL 411",
        "fullName": "Food Security, Human Rights and Public Health",
        "courseCredits": "3.0",
        "courseDesc": "This course examines the field of public health nutrition through the lens of international human rights and social and political contexts in the United States. Not only is this course scholarly and informative, but it engages students’ personal experiences with food and family, invited guest speakers, a field trip, and debates on critical policy issues in nutrition and public health in the United States.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 422": {
        "shortName": "PBHL 422",
        "fullName": "Health and Human Rights Research Methods",
        "courseCredits": "3.0",
        "courseDesc": "This seminar focuses on the application of human rights norms and tools to public health and particular challenges within public health. Building upon human rights frameworks, we will discuss current debates about the usefulness of a “human rights approach” to health, the methods and ethics of health-related human rights research, and case studies of human rights investigations and advocacy. The case studies are intended to examine how human rights abuses, including violations of economic and social rights and civil and political rights, can be understood as determinants of health.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 304 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 453": {
        "shortName": "PBHL 453",
        "fullName": "Longitudinal Data Analysis",
        "courseCredits": "3.0",
        "courseDesc": "Longitudinal data measure characteristics on the experimental units repeatedly over time. It is an essential design to study temporal change and to establish causal relationships. The analysis of longitudinal data requires sophisticated methodologies due to the correlation introduced by repeated measurements. This course covers modern statistical techniques for longitudinal data from an applied perspective.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 210 [Min Grade C] and PBHL 455 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 455": {
        "shortName": "PBHL 455",
        "fullName": "Introduction to Statistical Computing",
        "courseCredits": "3.0",
        "courseDesc": "Research projects often involve the management and manipulation of complicated sets of data. This course is designed to introduce the student to practical issues in the management and analysis of health and pharmaceutical data using the SAS programming language. Data from a variety of public health and biomedical applications will be used throughout the course to illustrate the principles of data management and analysis for addressing biomedical and health-related hypotheses.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 457": {
        "shortName": "PBHL 457",
        "fullName": "Adapting to a Hotter Climate: Protecting Health of Vulnerable Populations",
        "courseCredits": "3.0",
        "courseDesc": "This course provides an overview of the public health impacts of a changing global climate and strategies to prevent or reduce these impacts. How will societies cope with projected worsening of heat waves, extreme storms, and air pollution, shifts in vector-borne diseases, and displacement of populations sea-level rise? The course will survey the direct and indirect impacts of climate change on human health. Emphasis will be on changes in environmental conditions, stressors placed on human populations, and the strategies that societies will have to develop to reduce impacts on vulnerable populations.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 458": {
        "shortName": "PBHL 458",
        "fullName": "Crisis and Risk Communication in Public Health",
        "courseCredits": "3.0",
        "courseDesc": "Students will learn to create effective risk communication messages that are both theoretically grounded and based upon key lessons learned from the field of public health preparedness. Using a case study approach, and with an emphasis on developing skills including message design and evaluation, this course aims to give students an applied experience that will serve as a foundation for a career in public health or health communication.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 459": {
        "shortName": "PBHL 459",
        "fullName": "Survival Data Analysis",
        "courseCredits": "3.0",
        "courseDesc": "This course covers the basic techniques of survival analysis. These approaches are useful in analyzing cohort data, which are common in health studies, when the main interest outcome is the onset of event and time to event is known. The response is often referred to as failure time, survival time, or event time, and this course will introduce students to methods necessary for analyzing this type of data.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 211 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 495": {
        "shortName": "PBHL 495",
        "fullName": "Health Data Analytics Capstone",
        "courseCredits": "3.0",
        "courseDesc": "The senior capstone is a culminating experience for the health data analytics major. In this course, students will integrate the skills from their undergraduate coursework in a data analysis project motivated by scientific questions.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 497": {
        "shortName": "PBHL 497",
        "fullName": "Capstone Experience I",
        "courseCredits": "2.0",
        "courseDesc": "The senior capstone is a progressive 3-quarter experience with cross cutting competencies for graduating public health major seniors to provide them with an individualized learning experience of breadth and depth. Students will work with faculty members to design a project that will fulfill both their public health interests as well as the broader capstone objectives. Students will participate in in-class learning with other public health majors to acquire foundational concepts, which they can apply to their individualized project.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 301 [Min Grade C-] and PBHL 302 [Min Grade C-] and PBHL 303 [Min Grade C-] and PBHL 304 [Min Grade C-] and PBHL 308 [Min Grade C-] and PBHL 314 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 498": {
        "shortName": "PBHL 498",
        "fullName": "Capstone Experience II",
        "courseCredits": "3.0",
        "courseDesc": "The senior capstone is a progressive 3-quarter experience with cross cutting competencies for graduating public health major seniors to provide them with an individualized learning experience of breadth and depth. Students will work with faculty members to design a project that will fulfill both their public health interests as well as the broader capstone objectives. Students will participate in in-class learning with other public health majors to acquire foundational concepts, which they can apply to their individualized project.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 301 [Min Grade C-] and PBHL 302 [Min Grade C-] and PBHL 303 [Min Grade C-] and PBHL 304 [Min Grade C-] and PBHL 308 [Min Grade C-] and PBHL 314 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL 499": {
        "shortName": "PBHL 499",
        "fullName": "Capstone Experience III",
        "courseCredits": "3.0",
        "courseDesc": "The senior capstone is a progressive 3-quarter experience with cross cutting competencies for graduating public health major seniors to provide them with an individualized learning experience of breadth and depth. Students will work with faculty members to design a project that will fulfill both their public health interests as well as the broader capstone objectives. Students will participate in in-class learning with other public health majors to acquire foundational concepts, which they can apply to their individualized project.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "PBHL 301 [Min Grade C-] and PBHL 302 [Min Grade C-] and PBHL 303 [Min Grade C-] and PBHL 304 [Min Grade C-] and PBHL 308 [Min Grade C-] and PBHL 314 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "PBHL I199": {
        "shortName": "PBHL I199",
        "fullName": "Independent Study in PBHL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL I299": {
        "shortName": "PBHL I299",
        "fullName": "Independent Study in PBHL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL I399": {
        "shortName": "PBHL I399",
        "fullName": "Independent Study in PBHL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL I499": {
        "shortName": "PBHL I499",
        "fullName": "Independent Study in PBHL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL T180": {
        "shortName": "PBHL T180",
        "fullName": "Special Topics in Public Health",
        "courseCredits": "0.5-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL T280": {
        "shortName": "PBHL T280",
        "fullName": "Special Topics in Public Health",
        "courseCredits": "0.5-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL T380": {
        "shortName": "PBHL T380",
        "fullName": "Special Topics in Public Health",
        "courseCredits": "0.5-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "PBHL T480": {
        "shortName": "PBHL T480",
        "fullName": "Special Topics in Public Health",
        "courseCredits": "0.5-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "Dornsife School of Public Health",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    }
}