{
    "SCL 101": {
        "shortName": "SCL 101",
        "fullName": "Principles of Coaching",
        "courseCredits": "3.0",
        "courseDesc": "This course will include setting performance goals in coaching, the various roles of the coach, ethical conduct in coaching, the psychology of coaching, coach-athlete compatibility, coaching burnout, personality of the coach, and coaching youth sports. An emphasis is places on conducting practices and competitions to enhance the social-emotional growth of athletes.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 102": {
        "shortName": "SCL 102",
        "fullName": "Principles of Coaching II",
        "courseCredits": "3.0",
        "courseDesc": "This course will examine the administrative side of coaching by approaching the profession from a business manager’s standpoint. Students will be introduced to the business concepts and techniques applicable to coaching athletics.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 201": {
        "shortName": "SCL 201",
        "fullName": "Sport-Based Youth Development",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to provide students with an understanding of the field of sport-based youth development (SBYD). Students will learn about sport-based youth development best practices, establishing program goals, key components to successful programs, strategies for financially supporting SBYD programs, and established guidelines for program assessment and growth.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 203": {
        "shortName": "SCL 203",
        "fullName": "Sports Conditioning",
        "courseCredits": "3.0",
        "courseDesc": "This course will take a multi-faceted approach to the general science of strength training and sports conditioning. Students will gain a basic understanding behind training principles by covering the following topics: exercise physiology concepts and applications, testing and evaluation, flexibility and exercise techniques, program design, periodization, aerobic and anaerobic training considerations. This course will provide a practical challenge to the students to apply scientific concepts and principles to the development of a sport specific program in a sport of their choice. Developing and administering a training plan is a key component to coaching and students will become adept at this skill after completing this course.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 210": {
        "shortName": "SCL 210",
        "fullName": "Prevention and Care of Athletic Injuries",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to introduce the student to the care and prevention of athletic injuries. The course content will include a review of pertinent anatomical structures and their relationship to injuries. The course will also cover mechanisms of injuries, intrinsic and extrinsic variables of injuries, and basic preventative and treatment measures for common sports related injuries. In addition, students will complete the requirements of American Sport Education Program (ASEP) curriculum for Sport First Aid certification and complete the on-line Sport First Aid Test.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 280": {
        "shortName": "SCL 280",
        "fullName": "Kinesiology",
        "courseCredits": "3.0",
        "courseDesc": "This course provides an introduction and overview to the science of human movement. Identifies uses of the field of kinesiology in relation to science, medicine, human behavior, athletics, and overall fitness. Applies knowledge and concepts to the areas of physical activity, athletics, and recreation/fitness. Students will actively participate in and observe human movement in human performance labs.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 314": {
        "shortName": "SCL 314",
        "fullName": "Sport Performance and Energy Systems",
        "courseCredits": "3.0",
        "courseDesc": "This course covers nutrient categories and how they function in the body, with a particular emphasis on how to instill in athletes the advantages of healthy eating, and how to impart good information regarding food and food choices to a group of athletes in a team environment.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 315": {
        "shortName": "SCL 315",
        "fullName": "Athletic Recruiting",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to provide students with the necessary tools to become effective recruiters of athletic talent. Students will learn how to identify and recruit talent that will have a high impact within their athletic programs. Students will understand how to be compliant with NCAA, NAIA, and NJCAA rules when recruiting. A major deliverable of this course will be a comprehensive recruiting plan.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 325": {
        "shortName": "SCL 325",
        "fullName": "Athlete Leadership Development",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to provide students with an understanding of athlete leadership development and its importance in sport programming. Various athlete leadership models at the youth, scholastic, collegiate, and professional levels will be reviewed and students will have the opportunity to create their own athlete leadership development program.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 345": {
        "shortName": "SCL 345",
        "fullName": "Evaluating Athletes and Teams",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to provide students with the necessary tools to become effective evaluators of athletes, teams, and coaches. Students will learn how to create a comprehensive evaluation strategy and to communicate and share this strategy with key constituents to effectively manage overall improvement. A major deliverable of this course will be a comprehensive evaluation plan.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 401": {
        "shortName": "SCL 401",
        "fullName": "Professional Coaching Portfolio",
        "courseCredits": "3.0",
        "courseDesc": "The professional portfolio is a capstone course that provides Sport Coaching Leadership majors with an opportunity to demonstrate achievement in their major and to engage in self-reflection. Components include reflective essays and carefully chosen samples of academic and relevant professional work completed during the college experience.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 419": {
        "shortName": "SCL 419",
        "fullName": "Global Coaching Seminar",
        "courseCredits": "3.0",
        "courseDesc": "This course is designed to expose coaches to a variety of international coaching methods and concepts via a study abroad experience for 7-10 days. This seminar is offered each summer and locations vary by year. Each student in the Sport Coaching Leadership program will attend this study abroad experience. An emphasis is placed on athlete interaction and engagement, practice planning, recruiting, and sport for development.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SCL 101 [Min Grade C] and SCL 102 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "SCL 495": {
        "shortName": "SCL 495",
        "fullName": "Coaching Practicum I",
        "courseCredits": "3.0",
        "courseDesc": "The practicum is designed to develop greater breadth and depth of students' understanding and experience within the coaching industry. This course provides an opportunity for students to apply the knowledge and skills acquired in the Sport Coaching Leadership program in a practical setting. This is the first practicum in a series of three coaching practicums. This practicum experience will focus on using basic coaching theory and principles under the guidance of the current coaching or administrative staff.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 496": {
        "shortName": "SCL 496",
        "fullName": "Coaching Practicum II",
        "courseCredits": "3.0",
        "courseDesc": "The practicum is designed to develop greater breadth and depth of students' understanding and experience within the coaching industry. This course provides an opportunity for students to apply the knowledge and skills acquired in the Sport Coaching Leadership program in a practical setting. This is the second practicum in a series of three coaching practicums. This practicum experience will focus on gaining experience in the administrative aspects of coaching under the guidance of the current coaching or administrative staff.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL 497": {
        "shortName": "SCL 497",
        "fullName": "Coaching Practicum III & Project",
        "courseCredits": "6.0",
        "courseDesc": "The practicum is designed to develop greater breadth and depth of students' understanding and experience within the coaching industry. This course provides an opportunity for students to apply the knowledge and skills acquired in the Sport Coaching Leadership program in a practical setting. This is the final practicum in a series of three coaching practicums. This practicum experience will focus on designing and completing a coaching project for a particular team under the guidance of the current coaching or administrative staff.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SCL 495 [Min Grade CR] and SCL 496 [Min Grade CR]",
        "coreqs": null,
        "restrictions": null
    },
    "SCL I199": {
        "shortName": "SCL I199",
        "fullName": "Independent Study in Sport Coaching Leadership",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed course requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL I299": {
        "shortName": "SCL I299",
        "fullName": "Independent Study in SCL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL I399": {
        "shortName": "SCL I399",
        "fullName": "Independent Study in SCL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL I499": {
        "shortName": "SCL I499",
        "fullName": "Independent Study in SCL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL T180": {
        "shortName": "SCL T180",
        "fullName": "Special Topics in Sport Coaching Leadership",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL T280": {
        "shortName": "SCL T280",
        "fullName": "Special Topics in SCL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL T380": {
        "shortName": "SCL T380",
        "fullName": "Special Topics in SCL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SCL T480": {
        "shortName": "SCL T480",
        "fullName": "Special Topics in SCL",
        "courseCredits": "0.0-12.0",
        "courseDesc": "",
        "courseDepartment": "School of Education",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    }
}