{
    "SMT 110": {
        "shortName": "SMT 110",
        "fullName": "The Business of Sport",
        "courseCredits": "4.0",
        "courseDesc": "This course will introduce students to the billion-dollar international sports industry and identify the vast, creative, and substantial role business plays in professional, collegiate and amateur sports. Sports business applications are explored in the following areas: sponsorship, promotions, marketing, fundraising, finance, media, ticketing, public relations, law, facilities, and sport careers.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 120": {
        "shortName": "SMT 120",
        "fullName": "The Business of Esport",
        "courseCredits": "4.0",
        "courseDesc": "This course will introduce students to the esport industry and discuss its foundational concepts. After discussing esport’s history, this course will explore the esport ecosystem. The duration of course will investigate the business model of esport, governance issues, potential career opportunities, and the future of esport.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 201": {
        "shortName": "SMT 201",
        "fullName": "Sports Marketing, Promotion, and Public Relations",
        "courseCredits": "4.0",
        "courseDesc": "Students will build an integrated marketing plan for a sporting event by first describing how the four Ps of marketing are applied in sports. Students learn about the uses of the essential elements of marketing. Students will be able to identify the conventions of sport promotions and public relations.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "MKTG 201 [Min Grade D] (Can be taken Concurrently)",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 205": {
        "shortName": "SMT 205",
        "fullName": "Sport Media Relations",
        "courseCredits": "4.0",
        "courseDesc": "This course is an overview of media relations and its role in the field of sport management. This course will cover skill sets and roles a media relations specialist must demonstrate in order to be successful. There will be emphasis on writing, communication, planning, and organizational skills.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 227": {
        "shortName": "SMT 227",
        "fullName": "Sport Entrepreneurship",
        "courseCredits": "4.0",
        "courseDesc": "This course will introduce students to the field of sport entrepreneurship by coupling entrepreneurship as a generic activity with the many opportunities the sports industry presents. It explores the challenges faced by individuals starting up new ventures and the probable paths of career development for students pursuing entrepreneurship.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 230": {
        "shortName": "SMT 230",
        "fullName": "Sports and the Law",
        "courseCredits": "4.0",
        "courseDesc": "Reviews the legal and regularity aspects, elements, and relationships for all constituents participating in sports: administrators, coaches, athletes, agents, vendors, sponsors, faculty managers and owners, and spectators. Seminal court cases are discussed. Students examine the inextricable links between the law and business ethics.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 240": {
        "shortName": "SMT 240",
        "fullName": "Olympic Games",
        "courseCredits": "4.0",
        "courseDesc": "Provides an overview of modern Olympic Games focusing on the organization, politics, economic implications and the bidding process of the Games. Topics of sponsorship, media coverage and ethical considerations will be discussed. The course will also address how the spirit of the Olympic Games has changed over time.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 245": {
        "shortName": "SMT 245",
        "fullName": "NCAA Compliance",
        "courseCredits": "4.0",
        "courseDesc": "This course will overview basic regulatory, legal and due process rules that govern NCAA competition. Course will cover elements of NCAA regulations, rules interpretations, enforcement decisions and sanctions. An understanding of NCAA rules compliance will be gained through legal cases and actual NCAA enforcement proceedings.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 254": {
        "shortName": "SMT 254",
        "fullName": "Women & Minority Opportunities in Sport",
        "courseCredits": "3.0",
        "courseDesc": "This course chronicles the major events and strategies used for women and minorities to have equal opportunities to participate in sports at all levels. It pOints out the social and legal issues surrounding the dramatic rise in women and minority participation at all levels of play.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 255": {
        "shortName": "SMT 255",
        "fullName": "Legal Foundations of Title IX",
        "courseCredits": "4.0",
        "courseDesc": "This course will overview the basic legal concepts surrounding Title IX and its applications to intercollegiate athletics programs. The basic elements of Title IX and how various tests are applied by the court system will be included. Course will focus on actual legal cases, investigations and remedial plans.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 260": {
        "shortName": "SMT 260",
        "fullName": "Sports Agents & Labor Relations",
        "courseCredits": "4.0",
        "courseDesc": "This course examines the controversial nature of being a sports agent. Students will be exposed to legal and ethical issues that surround sports agents. Additionally, students will review the labor relations laws and collective bargaining agreements that govern professional sports through a variety of lectures, readings and assignments.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SMT 230 [Min Grade C-] or BLAW 201 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 262": {
        "shortName": "SMT 262",
        "fullName": "Digital Sports Storytelling",
        "courseCredits": "4.0",
        "courseDesc": "This course is designed to introduce students to digital storytelling in sports. Topics will include locating and defining a sports story, framing a sports story for audience and platform, and storyboarding. Students will learn the power behind stories and how to use them to enhance and develop fan engagement, drive attendance and increase sponsorship. Students will write, produce and edit digital stories on mobile platforms.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SMT 110 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 270": {
        "shortName": "SMT 270",
        "fullName": "Sports Facility Planning & Management",
        "courseCredits": "4.0",
        "courseDesc": "This course is designed to provide learning experiences in managing sport facility operations, planning new sport facilities, and renovating and maintaining new facilities. An understanding of sports facilities, their design, and management will be gained through field study, speakers, and standard classroom material.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 275": {
        "shortName": "SMT 275",
        "fullName": "Sports Event Management",
        "courseCredits": "4.0",
        "courseDesc": "This course provides the student with exposure to comprehensive event planning, funding and managing sports events including those for professional, amateur and collegiate sports events, and commercial, recreational, and club sports.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 285": {
        "shortName": "SMT 285",
        "fullName": "Sport, Industry, and Society",
        "courseCredits": "4.0",
        "courseDesc": "The focus of this course is on the social forces that shape the sport industry in the United States and internationally and the influence the sport industry has on society. Students are encouraged to critically examine common understandings of sport from economic, historical, political, and sociological perspectives.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SMT 110 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 290": {
        "shortName": "SMT 290",
        "fullName": "Digital Media in Sport",
        "courseCredits": "4.0",
        "courseDesc": "This course is designed to introduce students to the digital landscape of sport business. Topics include current issues in digital sports media, digital media and sports facilities, digital media and professional sports teams, mobile applications in sport, and selling digital sport products and services.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SMT 110 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 305": {
        "shortName": "SMT 305",
        "fullName": "Fundraising in Sports",
        "courseCredits": "4.0",
        "courseDesc": "Fundraising in Sports will examine the skills, strategies and techniques needed for successful annual and major gift solicitation in the field of athletic development. Areas to be addressed include: understanding annual fund and major gift fundraising, examining booster club: organization structure and benefits, priority seating programs, the importance of donor research in the fundraising process, capital campaigns in sport, and the use of special events to achieve fundraising success.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SMT 110 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 307": {
        "shortName": "SMT 307",
        "fullName": "Corporate Sponsorship in Sports",
        "courseCredits": "4.0",
        "courseDesc": "Course will examine marketing strategy and techniques used by industry professionals to increase revenues for sports properties. Students will gain an understanding of sponsorship sales terminology, cold calling and prospecting techniques, marketing proposal presentation guidelines and relationship building strategies to increase overall sales.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 310": {
        "shortName": "SMT 310",
        "fullName": "Sports Contracts",
        "courseCredits": "4.0",
        "courseDesc": "Course will cover basic legal issues and strategies surrounding contract issues in sports. Students will be introduced to basic elements of contract law and see it applied by the court system in the context of the sports industry.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SMT 230 [Min Grade C-] or BLAW 201 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 320": {
        "shortName": "SMT 320",
        "fullName": "Sport Economics",
        "courseCredits": "4.0",
        "courseDesc": "An introduction to the economics of sports. Topics include sports markets: demand, supply and pricing; organization, monopoly power and market failure; labor relations, labor market problems and remedies, public finance of sports, the law and economics of sports, and the economics of college sports.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ECON 201 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 321": {
        "shortName": "SMT 321",
        "fullName": "Money, Power, Politics: College Sports in America",
        "courseCredits": "4.0",
        "courseDesc": "Students will examine the dynamics that drive college athletics departments today. Looking through the lens of divisional and conference affiliation, students will begin to understand internal and external forces that drive athletics outcomes.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 325": {
        "shortName": "SMT 325",
        "fullName": "Business of Sports Media",
        "courseCredits": "4.0",
        "courseDesc": "This course examines the media companies’ financial relationships with sports franchises both nationally and internationally. Students will assess the technology shifts over time and learn how those broadcasters who control sports programming have been aided by favorable Federal policies and interpretations, as well as (at times) Congressional intervention. Included in this course is an examination of how the NFL, Major League Baseball, the NBA and College Conference Networks structure their media rights deals. Students will research how to value a media deal.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 333": {
        "shortName": "SMT 333",
        "fullName": "Sports Gambling",
        "courseCredits": "4.0",
        "courseDesc": "This course will review and examine the history, policies, economics, and regulation of sports gambling in the United States. The emphasis will be on assisting the student in understanding the concepts related to the relatively new area of legalized sports betting in the United States. Class sessions will be devoted to examining and discussing the reading assignments and current issues in the field of sports gambling. Real world examples will be used to illustrate the concepts and principles.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 335": {
        "shortName": "SMT 335",
        "fullName": "Sport Governance & Policy",
        "courseCredits": "4.0",
        "courseDesc": "Basic theories of organization and leadership applied to sport organizations. Included are professional team-sport leagues, intercollegiate athletics, the Olympic movement, and international sport associations.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 340": {
        "shortName": "SMT 340",
        "fullName": "International Aspects of Sport",
        "courseCredits": "4.0",
        "courseDesc": "International sport should be understood within and outside the culture of a country in which it is being played or viewed. This course will allow students to develop an appreciation of non-American sporting cultures across the world, learn about potentially unfamiliar sports and sporting events and contrast different aspects of the sports industry with those within the US. Globalization and its implications for the sporting world will also be investigated, as will trans-­­national companies and organizations that impact the sport marketplace.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "SMT 110 [Min Grade D]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 350": {
        "shortName": "SMT 350",
        "fullName": "Corporate Social Responsibility in Sport",
        "courseCredits": "4.0",
        "courseDesc": "Course provides an overview of the concept of ‘corporate social responsibility’ (CSR), focusing on the economic, social and environmental impacts of the sport industry and the resulting challenges faced by sport organizations, their participants and their managers. The emphasis will be on assisting the student in understanding the concepts related to the role sport plays in CSR. Class sessions will be devoted to examining and discussing the reading assignments and current CSR issues in sport. Real world examples will be used to illustrate the concepts and principles.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 362": {
        "shortName": "SMT 362",
        "fullName": "Sport Ticket Sales",
        "courseCredits": "4.0",
        "courseDesc": "This course provides training in all aspects of ticket sales including networking, prospecting and qualifying, creating sales proposals, overcoming objections, and closing sales. Specific techniques such as role playing will be used to prepare students for careers in sport ticket sales.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 372": {
        "shortName": "SMT 372",
        "fullName": "Sport Business Consulting",
        "courseCredits": "4.0",
        "courseDesc": "In this course, students act as consultants for an organization, focusing on developing insights for sport business challenges. Students conduct research and analyses to form recommendations that will help the organization achieve its goals. In addition to working closely with faculty, students also interact with and present their work to leaders within the participating organization.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT 375": {
        "shortName": "SMT 375",
        "fullName": "Sport Finance",
        "courseCredits": "4.0",
        "courseDesc": "Basic theory in finance applied to managerial decision making in sport firms and organizations. Includes forms of ownership, financial analysis, risk analysis and portfolio evaluation, and capital budgeting techniques, all as applied to sports. The finance of sports facilities including taxation and subsidization and methods for evaluating publicly financed projects.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "FIN 301 [Min Grade C-]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 380": {
        "shortName": "SMT 380",
        "fullName": "Sports Analytics",
        "courseCredits": "4.0",
        "courseDesc": "Theory, development, and application of analytics in sport. The application of analytics in sport for purposes of evaluating player performance, managerial decisions, pricing, and other areas in sport industry operations.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "STAT 201 [Min Grade C]",
        "coreqs": null,
        "restrictions": null
    },
    "SMT 475": {
        "shortName": "SMT 475",
        "fullName": "Sports Industry Practicum",
        "courseCredits": "4.0",
        "courseDesc": "The practicum is designed to develop greater breadth and depth of students' understanding and experience within the industry. The practical application of knowledge and skill acquired in class will help students extend their expertise by working in a sport management related organization. Suggested for non-co-op students.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated 2 times for 12 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT I199": {
        "shortName": "SMT I199",
        "fullName": "Independent Study in SMT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT I299": {
        "shortName": "SMT I299",
        "fullName": "Independent Study in SMT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT I399": {
        "shortName": "SMT I399",
        "fullName": "Independent Study in SMT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT I499": {
        "shortName": "SMT I499",
        "fullName": "Independent Study in SMT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT T180": {
        "shortName": "SMT T180",
        "fullName": "Special Topics in Sport Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT T280": {
        "shortName": "SMT T280",
        "fullName": "Special Topics in Sport Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT T380": {
        "shortName": "SMT T380",
        "fullName": "Special Topics in Sport Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    },
    "SMT T480": {
        "shortName": "SMT T480",
        "fullName": "Special Topics in Sport Management",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "LeBow College of Business",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null
    }
}