{
    "WRIT 195": {
        "shortName": "WRIT 195",
        "fullName": "Threshold Concepts in Writing Studies",
        "courseCredits": "3.0",
        "courseDesc": "This course introduces students to threshold concepts in writing studies. Threshold concepts are “concepts critical for continued learning and participation in an area or within a community of practice” (Adler-Kassner and Wardle 2). In this course, we will explore how threshold concepts in writing studies provide insight into writing and writing process, using them to analyze texts and our own experiences as writers.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "WRIT 200": {
        "shortName": "WRIT 200",
        "fullName": "Language Puzzles and Word Games: Issues in Modern Grammar",
        "courseCredits": "3.0",
        "courseDesc": "In this course, we will investigate how grammar is presented, debated, and viewed in our culture. While you will learn about grammar along the way, this is not a hard-core course about learning grammatical correctness. Rather, we will examine the consequences of grammar in how we think about language and, thus, how we think about one another.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "WRIT 210": {
        "shortName": "WRIT 210",
        "fullName": "The Peer Reader in Context",
        "courseCredits": "3.0",
        "courseDesc": "This course focuses on reading and writing practices. Students engage in autobiographical explorations and examine writing center theory and practice. After successful completion, students may apply to become a Drexel Writing Center Peer Reader.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(ENGL 101 [Min Grade C] or ENGL 111 [Min Grade C]) and (ENGL 102 [Min Grade C] or ENGL 112 [Min Grade C])",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Spring "
    },
    "WRIT 211": {
        "shortName": "WRIT 211",
        "fullName": "Advanced Composition",
        "courseCredits": "3.0",
        "courseDesc": "This course exposes students to theories and practices that shape how we think about composition. Students will have the opportunity to research topics related to their own writing experiences and interests, particularly in terms of disciplines in which they participate or are interested.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "WRIT 212": {
        "shortName": "WRIT 212",
        "fullName": "Intro to Rhetorical Theory",
        "courseCredits": "3.0",
        "courseDesc": "Rhetoric is a way of understanding texts as oriented to audiences and intentions. Rhetorical theory has taken many forms from ancient to contemporary times, and across the globe. This course introduces students to some of these theories, such as feminist, material, and dramatist, and engages students in their own rhetorical criticism projects that build from these approaches.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter "
    },
    "WRIT 215": {
        "shortName": "WRIT 215",
        "fullName": "Story Medicine",
        "courseCredits": "3.0",
        "courseDesc": "Students go to local hospitals to perform for pediatric patients. Students host, write scripts and lead imagination activities for patients. Students will also write fiction. Subjects covered include: character, plot, setting, and sensory writing. All exercises are suitable for beginning and intermediate fiction writers.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D], ENGL 113 [Min Grade D] (Can be taken Concurrently) or (ENGL 101 [Min Grade D] or ENGL 111 [Min Grade D]) and (ENGL 102 [Min Grade D] or ENGL 112 [Min Grade D])",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 220": {
        "shortName": "WRIT 220",
        "fullName": "Creative Nonfiction Writing",
        "courseCredits": "3.0",
        "courseDesc": "A writing workshop in which students will read and write nonfiction; emphasis is placed on experimenting with different forms such as the personal essay, literary journalism, nature writing, science writing and editing, and preparing manuscripts for publication.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 225": {
        "shortName": "WRIT 225",
        "fullName": "Creative Writing",
        "courseCredits": "3.0",
        "courseDesc": "A workshop course in composing imaginative forms of personal expression, including poems, short stories, and personal essays.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring Summer"
    },
    "WRIT 226": {
        "shortName": "WRIT 226",
        "fullName": "Writing in Public Spaces",
        "courseCredits": "3.0",
        "courseDesc": "This introductory-level creative writing course asks students to write descriptively about objects in museums and public spaces around the city. The class meets mostly in public spaces. The last two classes will be held on campus to workshop the short stories we will produce over the term.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 250": {
        "shortName": "WRIT 250",
        "fullName": "“Mistakes Were Made”: Truth, Writing, and Responsibility",
        "courseCredits": "3.0",
        "courseDesc": "Examines ways that writing—and writers—can represent and misrepresent through exploration of topics such as metaphor, representation of facts and events in nonfiction writing, and even use (and misuse) of the verb to be.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 280": {
        "shortName": "WRIT 280",
        "fullName": "The Writers Room Lab Credit",
        "courseCredits": "1.0",
        "courseDesc": "The Writers Room LAB Credit is a single-credit laboratory meant to be attached to courses with projects engaging in civic action. The LAB credit is meant to allow motivated and self-directed students to invest more time in integrating the knowledge from an academic class with community work participated in beyond the classroom setting (and as aspects of the course). The student will engage in reflective writing at the beginning and end of the course that will frame and deepen the synthesis of academic knowledge and experiential action taken in the community.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 290": {
        "shortName": "WRIT 290",
        "fullName": "Writers Room Experience",
        "courseCredits": "0.0-3.0",
        "courseDesc": "The Writers Room Experience builds community writing skills, with a particular emphasis on active listening, multi-modal storytelling, collaborative text production, and the processing of heterogeneous group experiences through field note-taking and reflective and recursive writing practices. This course is meant to be repeatable, and taken for variable credit (0-3) depending on the time commitment the student contracts for and their available credits.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Spring "
    },
    "WRIT 295": {
        "shortName": "WRIT 295",
        "fullName": "Forms Seminar",
        "courseCredits": "3.0",
        "courseDesc": "Introduces students to concepts and terminology that allows them to describe formal qualities of creative texts. Supports creative writers by helping them consider how formal features contribute to the meaning or effect of a text, as well as how to communicate about this to other writers (in order to help enhance workshop and collaborative writing situations). This variable topics course may focus on fiction/prose writing, poetry, or sentence-level style.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 2 times for 9 credits",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 301": {
        "shortName": "WRIT 301",
        "fullName": "Writing Poetry",
        "courseCredits": "3.0",
        "courseDesc": "A writing workshop in which students will read and write poetry; emphasis is placed on experimenting with different forms of poetry, editing, and manuscript preparations for publication.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring Summer"
    },
    "WRIT 302": {
        "shortName": "WRIT 302",
        "fullName": "Writing Fiction",
        "courseCredits": "3.0",
        "courseDesc": "A creative writing workshop course focusing on fiction. Students read and write short stories. Students develop skills by creating complete fictional works and critiquing the work of other students. Emphasis placed on narrative structure, prose style, pacing, voice and tone, appropriate material, character, plot, description, dialogue, and editing.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring Summer"
    },
    "WRIT 303": {
        "shortName": "WRIT 303",
        "fullName": "Writing Humor and Comedy",
        "courseCredits": "3.0",
        "courseDesc": "A creative writing course focusing on humor and comedy. Students read and write satire, essays, social commentary and special forms. Students develop skills by creating complete works and critiquing the work of other students. Emphasis is placed on writing for specific audiences, narrative structure, prose style and editing.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "WRIT 305": {
        "shortName": "WRIT 305",
        "fullName": "Life is Beautiful",
        "courseCredits": "3.0",
        "courseDesc": "This community partnership course links memoir with life, story-telling, and dying. Specifically, the course partners students with local hospice patients to co-create a life-story for the patient and his or her family. Students learn interviewing, listening, and writing techniques as well as skills in analysis and presentation. Additionally, the course facilitates interactions with the community and helps students to see themselves as linked to a community outside of college.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 12 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 306": {
        "shortName": "WRIT 306",
        "fullName": "Writing About the Media",
        "courseCredits": "4.0",
        "courseDesc": "This course teaches students how to write about media events and artifacts (books, movies, theatre, music, etc.), both as individual works and in a larger cultural context. It also teaches them about the kinds of media outlets which publish reviews and the style of writing these outlets favor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(ENGL 101 [Min Grade D] and ENGL 102 [Min Grade D] and ENGL 103 [Min Grade D]) or ENGL 105 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 308": {
        "shortName": "WRIT 308",
        "fullName": "Writing Your Novel",
        "courseCredits": "3.0",
        "courseDesc": "A fiction writing workshop that focuses on beginning the process of writing a novel. Its purpose is to help students develop their skill in creating their own fictional narratives. In addition, students will develop their skill as critical readers of fiction. Students will outline their own novel, write the first three chapters or equivalent (approximately 24-30 manuscript pages), read and critique student fiction, and participate in class discussions about student work and the concerns of fiction writers, including such matters as point-of-view, meaning, plot, scenes, setting, dialogue, description, tone, voice, syntax, editing, character, prose.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 310": {
        "shortName": "WRIT 310",
        "fullName": "Literary Editing & Publication",
        "courseCredits": "3.0",
        "courseDesc": "A course focusing on the techniques of editing, copyediting, proofreading, graphic selection and placement, the development of qualitative standards in manuscript selection for literary texts as well as connecting useful editorial/publication practice and social concerns in the fields of literary production.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall "
    },
    "WRIT 311": {
        "shortName": "WRIT 311",
        "fullName": "Writing and Reading the Memoir",
        "courseCredits": "3.0",
        "courseDesc": "Students will explore the problems and thrills of self-representation and self-expression through memoir. Deconstructing the work of other memoirists will show students how to develop themselves as flawed, yet likable protagonists. By the end of the course, students will be able to effectively analyze the elements of successful memoir, demonstrate an understanding of narrative theory, memory, and changing conceptions of “the self,” and articulate and implement these skills through analysis of literary texts and in construction of their own creative works.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "(ENGL 101 [Min Grade C] or ENGL 111 [Min Grade C]) and (ENGL 102 [Min Grade C] or ENGL 112 [Min Grade C]) and (ENGL 103 [Min Grade C] or ENGL 113 [Min Grade C])",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 312": {
        "shortName": "WRIT 312",
        "fullName": "Writing for Target Audiences",
        "courseCredits": "3.0",
        "courseDesc": "This course is structured as a writing workshop in which students will read and write in various rhetorical modes; emphasis is placed on experimenting with different forms such as review, proposal, and feature article writing as well as how to target various publications and therefore, various audiences. Students will read, discuss, and deconstruct published examples of many rhetorical modes, then write their own. Students will develop interview, review, research and persuasive writing skills.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "WRIT 315": {
        "shortName": "WRIT 315",
        "fullName": "Writing for Social Change",
        "courseCredits": "3.0",
        "courseDesc": "Guides students through a sequence of writing situations and activities central to writing for purposes of social change. Focusing on a current social issues, students will identify and define an issue, write to persuade the public and call for action, and attempt to gather support to address the issue.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 9 credits",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 320": {
        "shortName": "WRIT 320",
        "fullName": "Publishing Veterans’ Memoirs for the Library of Congress",
        "courseCredits": "3.0",
        "courseDesc": "This community-based learning (CBL) course connects Drexel students with local veterans to create texts for the Library of Congress Veterans History Project. By publishing experiences that are not often heard, students will broaden social understanding of the relationship of gender, race, and socioeconomics to war and peace. Students will explore writing as a healing modality, read selected texts, and learn interview techniques while meeting with local veterans. As students learn the veterans’ stories, they will work with the vets to craft narratives that fit Library of Congress guidelines. Male and female veterans will be included and will represent a wide range of military experiences. Students will practice writing, analysis and editing, and create a Library of Congress product to list on their resumes.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 330": {
        "shortName": "WRIT 330",
        "fullName": "Writing and Contexts",
        "courseCredits": "3.0",
        "courseDesc": "Offers writing practice and study of writing as it functions in different contexts (for example, Writing and the Brain, Writing and Freelance Work, Writing and Other Arts, Writing and Community Publishing). May be repeated for credit.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 12 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Winter Summer"
    },
    "WRIT 400": {
        "shortName": "WRIT 400",
        "fullName": "Writing in Cyberspace: Writing for/about the Web",
        "courseCredits": "4.0",
        "courseDesc": "In this advanced writing course, students explore writing in web environments. Through close reading of theories and formative ideas of cyberspace and the web, they consider how the digital environment affects ways we interact, write, and learn. Students rhetorically examine nuances of writing and writing process in digital spaces, and improve their ability to compose in them. Students will have opportunities to work in multiple genres, including creative and critical writing.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Not repeatable for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 401": {
        "shortName": "WRIT 401",
        "fullName": "Advanced Poetry Workshop",
        "courseCredits": "3.0",
        "courseDesc": "Advanced Poetry Workshop will focus on continuing to develop students’ poetry writing, editing, and criticism skills introduced inWRIT 225(Creative Writing) and/orWRIT 301(Poetry Writing). This class will concentrate on the art and skill of workshopping one another’s poems as well as using the critiques gained in workshops to revise and improve one’s poems.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": "WRIT 295 [Min Grade C] and WRIT 301 [Min Grade C]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 402": {
        "shortName": "WRIT 402",
        "fullName": "Advanced Fiction Workshop",
        "courseCredits": "3.0",
        "courseDesc": "The Advanced Fiction Workshop allows students to continue to develop as a fiction writer, building on writing, editing, and response skills introduced inWRIT 225Creative Writing,WRIT 302Writing Fiction, and other writing experiences.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 1 times for 6 credits",
        "prereqs": "WRIT 295 [Min Grade C] and WRIT 302 [Min Grade C]",
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT 405": {
        "shortName": "WRIT 405",
        "fullName": "Internship in Publishing",
        "courseCredits": "3.0",
        "courseDesc": "Internship in Publishing offers students knowledge of and practical experience in the publishing industry through the Drexel Publishing Group. Students participate in the administrative, editorial, publicity, and writing aspects of publishing by working on Drexel Publishing Group's publications, which may include The 33rd (an annual print anthology of creative and academic writing), Write Now Philly (an online book review and literary culture magazine), and other related projects.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 12 credits",
        "prereqs": "ENGL 103 [Min Grade D] or ENGL 113 [Min Grade D] or ENGL 105 [Min Grade A]",
        "coreqs": null,
        "restrictions": null,
        "offered": "Fall Winter Spring Summer"
    },
    "WRIT I199": {
        "shortName": "WRIT I199",
        "fullName": "Independent Study in WRIT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT I299": {
        "shortName": "WRIT I299",
        "fullName": "Independent Study in WRIT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT I399": {
        "shortName": "WRIT I399",
        "fullName": "Independent Study in WRIT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT I499": {
        "shortName": "WRIT I499",
        "fullName": "Independent Study in WRIT",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Self-directed within the area of study requiring intermittent consultation with a designated instructor.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT T180": {
        "shortName": "WRIT T180",
        "fullName": "Special Topics in Writing",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT T280": {
        "shortName": "WRIT T280",
        "fullName": "Special Topics in Writing",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": "Spring "
    },
    "WRIT T380": {
        "shortName": "WRIT T380",
        "fullName": "Special Topics in Writing",
        "courseCredits": "3.0",
        "courseDesc": "A variable topics course in writing in which students will read and write in different genres, according to the specific topic (i.e., Writing Fiction; Joking, Comedy and Laughter: Memoir and Autobiography: Nature Writing); emphasis is places on editing and manuscript preparation for publication. Students should anticipate a significant amount of writing in this course.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated 3 times for 12 credits",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    },
    "WRIT T480": {
        "shortName": "WRIT T480",
        "fullName": "Special Topics in Writing",
        "courseCredits": "0.0-12.0",
        "courseDesc": "Topics decided upon by faculty will vary within the area of study.",
        "courseDepartment": "College of Arts and Sciences",
        "repeatStatus": "Can be repeated multiple times for credit",
        "prereqs": null,
        "coreqs": null,
        "restrictions": null,
        "offered": ""
    }
}